{
	"@metadata": {
		"authors": [
			"Agabi10",
			"Ciencia Al Poder",
			"Dgstranz",
			"Fitoschido"
		]
	},
	"apihelp-wbcheckconstraints-summary": "Realiza comprobaciones de restricciones en cualquier entidad y devuelve el resultado.",
	"apihelp-wbcheckconstraints-param-id": "Lista de identificadores de las entidades de las que se obtendrán datos. Separa los valores con «|» u otra alternativa.",
	"apihelp-wbcheckconstraints-param-constraintid": "Filtro opcional para devolver solo las restricciones que tengan el identificador de restricción especificado.",
	"apihelp-wbcheckconstraints-param-status": "Filtro opcional para devolver solo resultados de la comprobación con los estados seleccionados.\n\nObserva que solo se almacenan en antememoria los resultados con los estados «violation», «warning» y «bad-parameters», de modo que las solicitudes que seleccionen otros estados no se beneficiarán de la antememoria.",
	"apihelp-wbcheckconstraints-paramvalue-status-compliance": "La declaración satisface la restricción.",
	"apihelp-wbcheckconstraints-paramvalue-status-violation": "La declaración viola la restricción.",
	"apihelp-wbcheckconstraints-paramvalue-status-exception": "La entidad sujeto de la declaración es una excepción conocida de la restricción.",
	"apihelp-wbcheckconstraints-paramvalue-status-todo": "La restricción no está implementada.",
	"apihelp-wbcheckconstraints-paramvalue-status-bad-parameters": "Los parámetros de la restricción son defectuosos.",
	"apihelp-wbcheckconstraints-paramvalue-status-deprecated": "No se ha comprobado la restricción porque la declaración es obsoleta.",
	"apihelp-wbcheckconstraints-paramvalue-status-warning": "La declaración viola la restricción, pero esta última no es obligatoria.",
	"apihelp-wbcheckconstraints-paramvalue-status-suggestion": "La declaración viola la restricción, pero la restricción es sólo una sugerencia.",
	"apihelp-wbcheckconstraintparameters-summary": "Verifica los parámetros de restricción de las declaraciones de restricción.",
	"apihelp-wbcheckconstraints-example-1": "Verificar todas las restricciones en los elementos Q5 y Q42.",
	"apihelp-wbcheckconstraints-example-2": "Verificar todas las restricciones en una sola declaración.",
	"apihelp-wbcheckconstraints-example-3": "Verificar una restricción particular en el elemento Q2.",
	"apihelp-wbcheckconstraintparameters-example-propertyid-1": "Verificar los parámetros de restricción de todas las restricciones de una propiedad.",
	"apihelp-wbcheckconstraintparameters-example-constraintid-2": "Verificar los parámetros de restricción de dos restricciones específicas."
}
