{
	"@metadata": {
		"authors": [
			"Gomoko",
			"Thibaut120094",
			"Verdy p",
			"Wladek92"
		]
	},
	"apihelp-wbcheckconstraints-summary": "Réalise des vérifications de contraintes sur toute entité que vous désirez et renvoie le résultat.",
	"apihelp-wbcheckconstraints-param-id": "Liste d’identifiants des entités pour lesquelles obtenir les données. Séparez les valeurs par « | » ou similaire.",
	"apihelp-wbcheckconstraints-param-claimid": "Liste des GUID identifiant une déclaration à vérifier pour générer un rapport sur leur contraintes. Séparez les valeurs par « | ».",
	"apihelp-wbcheckconstraints-param-constraintid": "Filtre facultatif pour ne retourner que les contraintes qui ont l’identifiant de contrainte spécifié.",
	"apihelp-wbcheckconstraints-param-status": "Filtre facultatif pour ne renvoyer que les résultats avec les états sélectionnés.\n\nNoter que seuls les résultats pour les états « violation », « avertissement », « suggestion » et « mauvais-paramètres » sont mis en cache, donc les requêtes qui sélectionnent un état autre que ces quatre là ne bénéficient pas du cache.",
	"apihelp-wbcheckconstraints-paramvalue-status-compliance": "La déclaration satisfait la contrainte.",
	"apihelp-wbcheckconstraints-paramvalue-status-violation": "La déclaration viole la contrainte.",
	"apihelp-wbcheckconstraints-paramvalue-status-exception": "L’entité sujet de la déclaration est une exception connue à la contrainte.",
	"apihelp-wbcheckconstraints-paramvalue-status-todo": "La contrainte n’est pas mise en œuvre.",
	"apihelp-wbcheckconstraints-paramvalue-status-bad-parameters": "Les paramètres de la contrainte sont erronés.",
	"apihelp-wbcheckconstraints-paramvalue-status-deprecated": "La contrainte n’a pas été vérifiée parce que la déclaration est obsolète.",
	"apihelp-wbcheckconstraints-paramvalue-status-warning": "La déclaration viole la contrainte, mais la contrainte n’est pas exigée.",
	"apihelp-wbcheckconstraints-paramvalue-status-suggestion": "La déclaration viole la contrainte, mais la contrainte n’est qu’une suggestion.",
	"apihelp-wbcheckconstraints-paramvalue-status-not-in-scope": "La contrainte n’est pas vérifiée sur ce type d’élément (valeur principale, qualificateur ou référence), donc la vérification de la contrainte est sautée.",
	"apihelp-wbcheckconstraintparameters-summary": "Vérifie les paramètres des déclarations de contrainte.",
	"apihelp-wbcheckconstraintparameters-extended-description": "Un des deux paramètres <var>property</var> ou <var>constraintid</var> au moins doit être spécifié ; toutes les contraintes sélectionnées par chacun des paramètres seront vérifiées.",
	"apihelp-wbcheckconstraintparameters-param-propertyid": "Liste des identifiants de propriété à vérifier. Toutes les déclarations de contrainte de ces propriétés seront vérifiées.\n\nSi ce paramètre est spécifié, il doit être non vide.",
	"apihelp-wbcheckconstraintparameters-param-constraintid": "Liste des identifiants de contrainte (GUID de déclaration de contrainte) à vérifier.\n\nSi ce paramètre est spécifié, il doit être non vide.",
	"apihelp-wbcheckconstraints-example-1": "Vérifier toutes les contraintes sur les éléments Q5 et Q42.",
	"apihelp-wbcheckconstraints-example-2": "Vérifier toutes les contraintes sur une seule déclaration.",
	"apihelp-wbcheckconstraints-example-3": "Vérifier une contrainte particulière sur l’élément Q2.",
	"apihelp-wbcheckconstraintparameters-example-propertyid-1": "Vérifier les paramètres de toutes les contraintes d’une propriété.",
	"apihelp-wbcheckconstraintparameters-example-constraintid-2": "Vérifier les paramètres de deux contraintes particulières."
}
