{
	"@metadata": {
		"authors": [
			"Eduardo Addad de Oliveira",
			"Eduardoaddad",
			"Felipe L. Ewald"
		]
	},
	"apihelp-wbcheckconstraints-summary": "Executa verificações de restrição em qualquer entidade que deseja e retorna o resultado.",
	"apihelp-wbcheckconstraints-param-id": "Lista de ID das entidades para obter os dados. Separar valores com '|' ou alternativa.",
	"apihelp-wbcheckconstraints-param-claimid": "Uma lista GUID identificando uma reivindicação para verificar um relatório de restrição. Separar valores com '|'.",
	"apihelp-wbcheckconstraints-param-constraintid": "Filtro opcional para devolver só as restrições que têm o identificador de restrição especificado.",
	"apihelp-wbcheckconstraints-param-status": "Filtro opcional para devolver só resultados com os estados selecionados.\n\nNote que só são armazenados na cache os resultados para os estados 'violation' (violação), 'warning' (aviso) e 'bad-parameters' (parâmetros incorretos), por isso os pedidos que selecionarem outros estados além destes três não beneficiam do armazenamento na cache.",
	"apihelp-wbcheckconstraints-paramvalue-status-compliance": "A declaração satisfaz a restrição.",
	"apihelp-wbcheckconstraints-paramvalue-status-violation": "A declaração viola a restrição.",
	"apihelp-wbcheckconstraints-paramvalue-status-exception": "A entidade da declaração é uma exceção conhecida à restrição.",
	"apihelp-wbcheckconstraints-paramvalue-status-todo": "A restrição não está implementada.",
	"apihelp-wbcheckconstraints-paramvalue-status-bad-parameters": "Os parâmetros da restrição estão incorretos.",
	"apihelp-wbcheckconstraints-paramvalue-status-deprecated": "A restrição não foi verificada porque a declaração foi descontinuada.",
	"apihelp-wbcheckconstraints-paramvalue-status-warning": "A declaração viola a restrição, mas a restrição não é obrigatória.",
	"apihelp-wbcheckconstraints-paramvalue-status-suggestion": "A declaração viola a restrição, mas a restrição é apenas uma sugestão.",
	"apihelp-wbcheckconstraints-paramvalue-status-not-in-scope": "A restrição não é verificada neste tipo de asserção (asserção principal, qualificador ou referência) portanto a verificação da restrição é omitida.",
	"apihelp-wbcheckconstraintparameters-summary": "Verifica os parâmetros de restrição das instruções de restrição.",
	"apihelp-wbcheckconstraintparameters-extended-description": "Podem ser especificados os dois parâmetros <var>property</var> e <var>constraintid</var>; Todas as restrições selecionadas por qualquer dos parâmetros serão verificadas.",
	"apihelp-wbcheckconstraintparameters-param-propertyid": "Lista de IDs de propriedade para verificar. Todas as instruções de restrição dessas propriedades serão verificadas.\n\nSe este parâmetro for especificado, ele não deve ser vazio.",
	"apihelp-wbcheckconstraintparameters-param-constraintid": "Lista de IDs de restrição (declaração de restrição GUIDs) para verificar.\n\nSe esse parâmetro for especificado, ele não deve ser vazio.",
	"apihelp-wbcheckconstraints-example-1": "Verifique todas as restrições sobre os itens Q5 e Q42.",
	"apihelp-wbcheckconstraints-example-2": "Verifique todas as restrições em uma única declaração.",
	"apihelp-wbcheckconstraints-example-3": "Verifique uma restrição particular no item Q2.",
	"apihelp-wbcheckconstraintparameters-example-propertyid-1": "Verifique os parâmetros de restrição de todas as restrições em uma propriedade.",
	"apihelp-wbcheckconstraintparameters-example-constraintid-2": "Verifique os parâmetros de restrição de duas restrições específicas."
}
