{
	"@metadata": {
		"authors": [
			"Athena in Wonderland",
			"Hamilton Abreu"
		]
	},
	"apihelp-wbcheckconstraints-summary": "Realiza a verificação das restrições de qualquer entidade que queira e devolve o resultado.",
	"apihelp-wbcheckconstraints-param-id": "Lista de identificadores das entidades de que serão obtidos os dados. Separar os valores com '|' ou alternativa.",
	"apihelp-wbcheckconstraints-param-claimid": "Lista de identificadores únicos globais (GUID) que identificam uma alegação para verificar um relatório de restrições. Separar os valores com '|'.",
	"apihelp-wbcheckconstraints-param-constraintid": "Filtro opcional para devolver só as restrições que têm o identificador de restrição especificado.",
	"apihelp-wbcheckconstraints-param-status": "Filtro opcional para devolver só resultados com os estados selecionados.\n\nNote que só são armazenados na cache os resultados para os estados 'violation' (violação), 'warning' (aviso), 'suggestion' (sugestão) e 'bad-parameters' (parâmetros incorretos), por isso os pedidos que selecionarem outros estados além destes não beneficiam do armazenamento na cache.",
	"apihelp-wbcheckconstraints-paramvalue-status-compliance": "A declaração satisfaz a restrição.",
	"apihelp-wbcheckconstraints-paramvalue-status-violation": "A declaração viola a restrição.",
	"apihelp-wbcheckconstraints-paramvalue-status-exception": "A entidade da declaração é uma exceção conhecida à restrição.",
	"apihelp-wbcheckconstraints-paramvalue-status-todo": "A restrição não está implementada.",
	"apihelp-wbcheckconstraints-paramvalue-status-bad-parameters": "Os parâmetros da restrição estão incorretos.",
	"apihelp-wbcheckconstraints-paramvalue-status-deprecated": "A restrição não foi verificada porque a declaração foi descontinuada.",
	"apihelp-wbcheckconstraints-paramvalue-status-warning": "A declaração viola a restrição, mas a restrição não é obrigatória.",
	"apihelp-wbcheckconstraints-paramvalue-status-suggestion": "A declaração viola a restrição, mas a restrição é só uma sugestão.",
	"apihelp-wbcheckconstraints-paramvalue-status-not-in-scope": "A restrição não é verificada neste tipo de asserção (asserção principal, qualificador ou referência) portanto a verificação da restrição é omitida.",
	"apihelp-wbcheckconstraintparameters-summary": "Verifica os parâmetros de restrição das declarações de restrições.",
	"apihelp-wbcheckconstraintparameters-extended-description": "Pode ser especificado qualquer, ou ambos, os parâmetros <var>property</var> e <var>constraintid</var>; serão verificadas todas as restrições selecionadas por qualquer dos parâmetros.",
	"apihelp-wbcheckconstraintparameters-param-propertyid": "Lista dos identificadores de propriedades a serem verificados. Serão verificadas todas as declarações de restrições destas propriedades.\n\nSe este parâmetro for especificado, não pode estar vazio.",
	"apihelp-wbcheckconstraintparameters-param-constraintid": "Lista dos identificadores de restrições (identificadores únicos globais (GUID) de declarações de restrições) a serem verificados.\n\nSe este parâmetro for especificado, não pode estar vazio.",
	"apihelp-wbcheckconstraints-example-1": "Verificar todas as restrições sobre os objetos Q5 e Q42.",
	"apihelp-wbcheckconstraints-example-2": "Verificar todas as restrições sobre uma só declaração.",
	"apihelp-wbcheckconstraints-example-3": "Verificar uma restrição em particular sobre o objeto Q2.",
	"apihelp-wbcheckconstraintparameters-example-propertyid-1": "Verificar os parâmetros de restrição de todas as restrições de uma propriedade.",
	"apihelp-wbcheckconstraintparameters-example-constraintid-2": "Verificar os parâmetros de restrição de duas restrições em particular."
}
