{
	"@metadata": {
		"authors": [
			"Inkowik",
			"Metalhead64",
			"Purodha"
		]
	},
	"wbqc-constraintreport": "Beschränkungsbericht",
	"wbqc-constraintreport-explanation-part-one": "Diese Spezialseite führt Beschränkungsprüfungen zu jedem gewünschten Objekt durch. Die vom Live-System abgerufenen Objekte und jede behobene Beschränkungsverletzung wird sofort von dieser Liste entfernt.",
	"wbqc-constraintreport-explanation-part-two": "Die Beschränkungen werden von den Eigenschaftsdiskussionsseiten einmal pro Woche geparst. Falls du eine Beschränkung hinzufügst/löschst/änderst, dauert es also bis zu einer Woche, bis dies vom Beschränkungsbericht in das Benutzerkonto übernommen wird. Es sind derzeit Migrationen der Beschränkungen zu den Aussagen der Eigenschaften in Bearbeitung. Das Aktivieren dieser Spezialseite führt Liveprüfungen aus.",
	"wbqc-constraintreport-form-section": "Beschränkungen für das Objekt überprüfen",
	"wbqc-constraintreport-form-submit-label": "Überprüfen",
	"wbqc-constraintreport-form-entityid-label": "Objektkennung:",
	"wbqc-constraintreport-result-headline": "Ergebnis für",
	"wbqc-constraintreport-invalid-entity-id": "Ungültige Objektkennung.",
	"wbqc-constraintreport-not-existent-entity": "Das Objekt ist nicht vorhanden!",
	"wbqc-constraintreport-empty-result": "Es gibt keine zu diesem Objekt definierten Beschränkungen.",
	"wbqc-constraintreport-status-violation": "Verletzung",
	"wbqc-constraintreport-status-compliance": "Übereinstimmung",
	"wbqc-constraintreport-status-exception": "Ausnahme",
	"wbqc-constraintreport-status-todo": "Todo",
	"wbqc-constraintreport-result-table-header-status": "Status",
	"wbqc-constraintreport-result-table-header-claim": "Behauptung",
	"wbqc-constraintreport-result-table-header-constraint": "Beschränkung",
	"wbqc-constraintreport-result-link-to-claim": "gehe zu Behauptung",
	"wbqc-constraintreport-result-link-to-constraint": "gehe zu Beschränkung",
	"wbqc-constraintreport-no-parameter": "keine",
	"wbq-subextension-name-wbqc": "Beschränkungen",
	"wbqc-violation-header-parameters": "Parameter:",
	"wbqc-violations-group": "Beschränkungen",
	"wbqc-violation-message": "Die Beschränkungsprüfung hat einen Verstoß aufgezeigt. Bitte klicke auf das Symbol, um weitere Informationen zu bekommen.",
	"wbqc-violation-message-not-yet-implemented": "Aus technischen Gründen wurde die Prüfung für die Beschränkung „$1“ noch nicht implementiert.",
	"wbqc-violation-message-value-needed": "Eigenschaften mit der Beschränkung „$1“ müssen einen Wert haben.",
	"wbqc-violation-message-value-needed-of-type": "Eigenschaften mit der Beschränkung „$1“ müssen Werte des Typs „$2“ haben.",
	"wbqc-violation-message-parameter-needed": "Eigenschaften mit der Beschränkung „$1“ benötigen einen Parameter „$2“.",
	"wbqc-violation-message-target-entity-must-exist": "Das Zielobjekt muss vorhanden sein.",
	"wbqc-violation-message-value-entity-must-exist": "Das Werteobjekt muss vorhanden sein.",
	"wbqc-violation-message-commons-link-no-existent": "Der Commons-Link muss vorhanden sein.",
	"wbqc-violation-message-commons-link-not-well-formed": "Der Commons-Link muss wohlgeformt sein.",
	"wbqc-violation-message-commons-link-check-for-namespace-not-yet-implemented": "Die Prüfung für den Namensraum „$1“ ist noch nicht implementiert.",
	"wbqc-violation-message-conflicts-with-property": "Diese Eigenschaft darf nicht verwendet werden, wenn es eine weitere Aussage mithilfe der Eigenschaft gibt, die in den Parametern definiert wurde.",
	"wbqc-violation-message-conflicts-with-claim": "Diese Eigenschaft darf nicht verwendet werden, wenn es eine weitere Aussage mithilfe der Eigenschaft gibt mit einem der Werte, der in den Parametern definiert wurde.",
	"wbqc-violation-message-diff-within-range": "Der Unterschied zwischen dem Wert dieser Eigenschaft und dem Wert der Eigenschaft, die in den Parametern definiert ist, darf weder kleiner als das Minimum noch größer als das Maximum sein, das in den Parametern definiert wurde.",
	"wbqc-violation-message-diff-within-range-property-must-exist": "Die Eigenschaft, die in den Parametern definiert wurde, muss vorhanden sein.",
	"wbqc-violation-message-diff-within-range-property-needs value": "Die in den Parametern angegebene Eigenschaft benötigt einen Wert.",
	"wbqc-violation-message-diff-within-range-must-have-equal-types": "Die in den Parametern definierte Eigenschaft muss einen Wert des gleichen Typs als diese Eigenschaft haben.",
	"wbqc-violation-message-format": "Der Eigenschaftswert muss mit dem in den Parametern definierten Muster übereinstimmen.",
	"wbqc-violation-message-inverse": "Diese Eigenschaft darf nur verwendet werden, wenn es eine Aussage zu ihrem Wertelement mithilfe der Eigenschaft gibt, die in den Parametern definiert wurde und dieses Element als seine Werte.",
	"wbqc-violation-message-item-property": "Diese Eigenschaft darf nur verwendet werden, wenn es eine weitere Aussage mithilfe der Eigenschaft gibt, die in den Parametern definiert wurde.",
	"wbqc-violation-message-item-claim": "Diese Eigenschaft darf nur verwendet werden, wenn es eine weitere Aussage mithilfe der Eigenschaft gibt mit einem der Werte, der in den Parametern definiert wurde.",
	"wbqc-violation-message-mandatory-qualifiers": "Alle in den Parametern definierten Eigenschaften müssen als Qualifikatoren zu dieser Aussage verwendet werden.",
	"wbqc-violation-message-multi-value": "Diese Eigenschaft muss mehrere Werte haben. Also muss es eine oder mehrere Behauptungen geben, die diese Eigenschaft verwenden.",
	"wbqc-violation-message-one-of": "Der Eigenschaftswert muss einer der folgenden Elemente sein, der in den Parametern definiert wurde.",
	"wbqc-violation-message-qualifier": "Die Eigenschaft darf nur als Qualifikator verwendet werden.",
	"wbqc-violation-message-qualifiers": "Die Eigenschaft darf nur mit den Qualifikatoren verwendet werden, die in den Parametern definiert wurden.",
	"wbqc-violation-message-range-properties-needed": "Eigenschaften mit Werten des Typs „$1“ und der Beschränkung „Bereich“ benötigen die Parameter „$2“.",
	"wbqc-violation-message-range": "Der Eigenschaftswert darf weder kleiner als das Minimum noch größer als das Maximum sein, der in den Parametern definiert wurde.",
	"wbqc-violation-message-single-value": "Diese Eigenschaft darf nur einen einzelnen Wert haben. Also darf nur eine Behauptung mithilfe dieser Eigenschaft vorhanden sein.",
	"wbqc-violation-message-symmetric": "Diese Eigenschaft darf nur verwendet werden, wenn es eine Aussage zu ihrem Wertelement mit der gleichen Eigenschaft gibt und dieses Element als ihrem Wert.",
	"wbqc-violation-message-type-relation-instance-or-subclass": "Der Parameter „Relation“ muss entweder „Instanz“ oder „Unterklasse“ sein.",
	"wbqc-violation-message-type": "Diese Eigenschaft darf nur zu Objekten verwendet werden, die in Relation zum Objekt sind (oder eine Unterklasse des Objekts), die in den Parametern definiert wurden.",
	"wbqc-violation-message-target-required-claim-property": "Diese Eigenschaft darf nur verwendet werden, wenn es eine Aussage zu ihrem Wertobjekt mithilfe der Eigenschaft gibt, die in den Parametern definiert wurde.",
	"wbqc-violation-message-target-required-claim-claim": "Diese Eigenschaft darf nur verwendet werden, wenn es eine Aussage zu ihrem Wertobjekt mithilfe der Eigenschaft mit einem der Werte gibt, der in den Parametern definiert wurde.",
	"wbqc-violation-message-value-type": "Dieser Eigenschaftswert muss in Relation zum Objekt stehen (oder eine Unterklasse des Objekts sein), der in den Parametern definiert wurde."
}
