{
	"@metadata": {
		"authors": [
			"Macofe",
			"Ayack",
			"Yzelf",
			"Gomoko",
			"Wladek92"
		]
	},
	"wbqc-constraintreport": "Rapport de contrainte",
	"wbqc-desc": "Vérifie les contraintes à la fois sur les éléments ainsi que les propriétés et affiche les résultats sur une page spéciale",
	"wbqc-constraintreport-explanation-part-one": "Cette page spéciale effectue les vérifications de contraintes sur n’importe quelle entité de votre choix. Les entités sont extraites du système en direct, de sorte que chaque violation de contrainte que vous corrigez maintenant sera immédiatement retirée de cette liste.",
	"wbqc-constraintreport-explanation-part-two": "Les contraintes sont analysées à partir des pages de discussion de la propriété une fois par semaine, donc si vous ajoutez, supprimez ou modifiez une contrainte, il peut falloir attendre jusqu’à une semaine pour que cette contrainte soit prise en compte dans ce rapport de contraintes. Il y a actuellement des travaux en cours pour migrer les contraintes de déclarations sur les propriétés, permettant ainsi à cette page spéciale d’effectuer des vérifications en direct.",
	"wbqc-constraintreport-form-section": "Vérifier les contraintes pour l'entité",
	"wbqc-constraintreport-form-submit-label": "Vérifier",
	"wbqc-constraintreport-form-entityid-label": "Identifiant de l'entité :",
	"wbqc-constraintreport-result-headline": "Résultats pour",
	"wbqc-constraintreport-invalid-entity-id": "Identifiant d'entité invalide.",
	"wbqc-constraintreport-not-existent-entity": "L'entité n'existe pas.",
	"wbqc-constraintreport-empty-result": "Il n'existe pas de contrainte définie sur cette entité.",
	"wbqc-constraintreport-status-violation": "Violation",
	"wbqc-constraintreport-status-compliance": "Conforme",
	"wbqc-constraintreport-status-exception": "Exception",
	"wbqc-constraintreport-status-todo": "En attente",
	"wbqc-constraintreport-result-table-header-status": "État",
	"wbqc-constraintreport-result-table-header-claim": "Déclaration",
	"wbqc-constraintreport-result-table-header-constraint": "Contrainte",
	"wbqc-constraintreport-result-link-to-claim": "aller à la déclaration",
	"wbqc-constraintreport-result-link-to-constraint": "aller à la contrainte",
	"wbqc-constraintreport-no-parameter": "aucune",
	"apihelp-wbcheckconstraints-description": "Réalise les contrôles de contraintes sur n'importe quelle entité que vous désirez et retourne les résultats.",
	"apihelp-wbcheckconstraints-param-id": "Liste d'ID des entités pour lesquelles ont veux les informations. Séparez les valeurs avec  '|' ou similaire.",
	"apihelp-wbcheckconstraints-param-claimid": "Liste de GUID identifiant une demande de vérification d'un rapport de contraintes. Valeurs séparées par '|'.",
	"apihelp-wbcheckconstraints-param-constraintid": "Filtre optionnel pour ne retourner que les contraintes qui ont l'ID de contrainte spécifié",
	"wbq-subextension-name-wbqc": "Contraintes",
	"wbqc-violation-header-parameters": "Paramètres :",
	"wbqc-violations-group": "Contraintes",
	"wbqc-violation-message": "La vérification de contrainte a identifié une violation. Veuillez cliquer sur l'icône pour plus d'informations.",
	"wbqc-violation-message-not-yet-implemented": "Pour des raisons techniques, la vérification de la contrainte « $1 » n’a pas encore été implémentée.",
	"wbqc-violation-message-security-reason": "Pour des raisons de sécurité, il n’est pas possible de vérifier la contrainte « $1 » pour l’instant. Nous travaillons à résoudre cela.",
	"wbqc-violation-message-value-needed": "Les propriétés avec la contrainte « $1 » requièrent une valeur.",
	"wbqc-violation-message-value-needed-of-type": "Les propriétés avec la contrainte « $1 » requièrent des valeurs de type « $2 ».",
	"wbqc-violation-message-parameter-needed": "Les propriétés avec la contrainte « $1 » requièrent un paramètre « $2 ».",
	"wbqc-violation-message-target-entity-must-exist": "L'entité cible doit exister.",
	"wbqc-violation-message-value-entity-must-exist": "L’entité définie en valeur doit exister.",
	"wbqc-violation-message-commons-link-no-existent": "Le lien Commons doit exister.",
	"wbqc-violation-message-commons-link-not-well-formed": "Le lien vers Commons contient des caractères invalides.",
	"wbqc-violation-message-commons-link-check-for-namespace-not-yet-implemented": "La vérification pour l’espace de noms « $1 » n’est pas encore implémentée.",
	"wbqc-violation-message-conflicts-with-property": "Cette propriété ne doit pas être utilisée lorsqu’il y a une autre déclaration utilisant cette propriété définie dans les paramètres.",
	"wbqc-violation-message-conflicts-with-claim": "Cette propriété ne doit pas être utilisée lorsqu’il y a une autre déclaration utilisant cette propriété avec l’une des valeurs définies dans les paramètres.",
	"wbqc-violation-message-diff-within-range": "La différence entre la valeur de cette propriété et la valeur de la propriété définie dans les paramètres doit être ni inférieure au minimum, ni supérieure au maximum définis dans les paramètres.",
	"wbqc-violation-message-diff-within-range-property-must-exist": "La propriété définie dans les paramètres doit exister.",
	"wbqc-violation-message-diff-within-range-property-needs value": "La propriété définie dans les paramètres doit avoir une valeur.",
	"wbqc-violation-message-diff-within-range-must-have-equal-types": "La propriété définie dans les paramètres doit avoir une valeur du même type que cette propriété.",
	"wbqc-violation-message-format": "La valeur de la propriété doit correspondre au modèle défini dans les paramètres.",
	"wbqc-violation-message-inverse": "Cette propriété doit être utilisée uniquement lorsque l’entité définie en valeur possède une déclaration utilisant la propriété (définie dans les paramètres) dont la valeur est cet élément.",
	"wbqc-violation-message-item-property": "Cette propriété doit être utilisée uniquement lorsqu’il y a une autre déclaration utilisant la propriété définie dans les paramètres.",
	"wbqc-violation-message-item-claim": "Cette propriété doit être utilisée uniquement lorsqu’il y a une autre déclaration utilisant cette propriété avec l’une des valeurs définies dans les paramètres.",
	"wbqc-violation-message-mandatory-qualifiers": "Toutes les propriétés définies dans les paramètres doivent être utilisées comme des qualificateurs sur cette déclaration.",
	"wbqc-violation-message-multi-value": "Cette propriété doit avoir plusieurs valeurs. C’est-à-dire qu’il doit y avoir plus d’une déclaration utilisant cette propriété.",
	"wbqc-violation-message-one-of": "La valeur de la propriété doit être l’un des éléments définis dans les paramètres.",
	"wbqc-violation-message-qualifier": "La propriété doit être utilisée uniquement comme qualificateur.",
	"wbqc-violation-message-qualifiers": "La propriété doit être utilisée uniquement avec les qualificateurs définis dans les paramètres (et aucun autre).",
	"wbqc-violation-message-range-properties-needed": "Les propriétés avec des valeurs de type « $1 » avec la contrainte « Intervalle » (''Range'') nécessitent les paramètres « $2 ».",
	"wbqc-violation-message-range": "La valeur de la propriété ne doit pas être inférieure au minimum, ni supérieure au maximum définis dans les paramètres.",
	"wbqc-violation-message-single-value": "Cette propriété doit avoir une valeur unique. C’est-à-dire qu’il doit y avoir une seule déclaration utilisant cette propriété.",
	"wbqc-violation-message-symmetric": "Cette propriété doit être utilisée uniquement lorsque l’entité définie en valeur possède une déclaration utilisant la propriété dont la valeur est cet élément.",
	"wbqc-violation-message-type-relation-instance-or-subclass": "Le paramètre « relation » doit être soit « instance », soit « sous-classe ».",
	"wbqc-violation-message-type": "Cette propriété doit être utilisée uniquement sur les éléments qui ont une relation avec l’élément (ou une sous-classe de l’élément) définie dans les paramètres.",
	"wbqc-violation-message-target-required-claim-property": "Cette propriété doit être utilisée uniquement lorsque l’entité définie en valeur possède une déclaration utilisant la propriété définie dans les paramètres.",
	"wbqc-violation-message-target-required-claim-claim": "Cette propriété doit être utilisée uniquement lorsque l’entité définie en valeur possède une déclaration utilisant la propriété avec l’une des valeurs définies en paramètres.",
	"wbqc-violation-message-value-type": "L’entité définie en valeur pour cette propriété doit avoir une relation avec l’élément (ou une sous-classe de l’élément) définie dans les paramètres."
}
