{
	"@metadata": {
		"authors": [
			"Macofe",
			"Alexmar983",
			"Beta16"
		]
	},
	"wbqc-constraintreport": "Controllo vincoli",
	"wbqc-desc": "Controlla i vincoli sia sugli elementi che sulle proprietà e visualizza i risultati in una pagina speciale",
	"wbqc-constraintreport-explanation-part-one": "Questa pagina speciale esegue la verifica dei vincoli per qualsiasi entità che si desidera. Le entità sono recuperate dal sistema direttamente, in modo che ogni violazione del vincolo che risolvi sarà immediatamente rimossa da questa lista.",
	"wbqc-constraintreport-explanation-part-two": "I vincoli sono analizzati dalle pagine di discussione delle proprietà una volta alla settimana, quindi se si aggiunge, cancella o modifica un vincolo, potrebbe richiedere fino a una settimana prima che venga preso in considerazione da questo controllo sui vincoli. Attualmente è in lavorazione la migrazione dei vincoli su dichiarazioni nelle proprietà, che consentirà di attivare questa pagina speciale per fare controlli in tempo reale.",
	"wbqc-constraintreport-form-section": "Controlla i vincoli per l'entità",
	"wbqc-constraintreport-form-submit-label": "Controlla",
	"wbqc-constraintreport-form-entityid-label": "ID entità:",
	"wbqc-constraintreport-result-headline": "Risultato per",
	"wbqc-constraintreport-invalid-entity-id": "Entità ID non valida.",
	"wbqc-constraintreport-not-existent-entity": "L'entità non esiste!",
	"wbqc-constraintreport-empty-result": "Non ci sono vincoli definiti su questa entità.",
	"wbqc-constraintreport-status-violation": "Violazione",
	"wbqc-constraintreport-status-compliance": "Conforme",
	"wbqc-constraintreport-status-exception": "Eccezione",
	"wbqc-constraintreport-status-todo": "Da fare",
	"wbqc-constraintreport-result-table-header-status": "Stato",
	"wbqc-constraintreport-result-table-header-claim": "Asserzione",
	"wbqc-constraintreport-result-table-header-constraint": "Vincolo",
	"wbqc-constraintreport-result-link-to-claim": "vai all'asserzione",
	"wbqc-constraintreport-result-link-to-constraint": "vai al vincolo",
	"wbqc-constraintreport-no-parameter": "nessuno",
	"wbq-subextension-name-wbqc": "Vincoli",
	"wbqc-violation-header-parameters": "Parametri:",
	"wbqc-violations-group": "Vincoli",
	"wbqc-violation-message": "Il controllo del vincolo ha rilevato una violazione. Si prega di fare clic sull'icona per ulteriori informazioni.",
	"wbqc-violation-message-not-yet-implemented": "Per motivi tecnici, il controllo per il vincolo di \"$1\" non è ancora stato implementato.",
	"wbqc-violation-message-security-reason": "Per motivi di sicurezza, il controllo per il vincolo di \"$1\" non è possibile al momento. Stiamo lavorando a una soluzione.",
	"wbqc-violation-message-value-needed": "Proprietà con vincolo \"$1\" devono avere un valore.",
	"wbqc-violation-message-value-needed-of-type": "Proprietà con vincolo \"$1\" devono avere valori di tipo \"$2\".",
	"wbqc-violation-message-parameter-needed": "Proprietà con il vincolo \"$1\" necessitano di un parametro \"$2\".",
	"wbqc-violation-message-target-entity-must-exist": "L'entità di destinazione deve esistere.",
	"wbqc-violation-message-value-entity-must-exist": "Il valore dell'entità deve esistere.",
	"wbqc-violation-message-commons-link-no-existent": "Il collegamento a Commons deve esistere.",
	"wbqc-violation-message-commons-link-not-well-formed": "Il collegamento a Commons deve essere ben formato.",
	"wbqc-violation-message-commons-link-check-for-namespace-not-yet-implemented": "Il controllo per il namespace \"$1\" non è stato ancora implementato.",
	"wbqc-violation-message-conflicts-with-property": "Questa proprietà non deve essere utilizzata quando c'è un'altra dichiarazione che usa la proprietà definita nei parametri.",
	"wbqc-violation-message-conflicts-with-claim": "Questa proprietà non deve essere utilizzata quando c'è un'altra dichiarazione che usa la proprietà con uno dei valori definiti nei parametri.",
	"wbqc-violation-message-diff-within-range": "La differenza tra il valore di questa proprietà e il valore della proprietà definita nei parametri non deve essere inferiore al valore minimo, né superiore al limite massimo definito nei parametri.",
	"wbqc-violation-message-diff-within-range-property-must-exist": "La proprietà definita nei parametri deve esistere.",
	"wbqc-violation-message-diff-within-range-property-needs value": "La proprietà definita nei parametri deve avere un valore.",
	"wbqc-violation-message-diff-within-range-must-have-equal-types": "La proprietà definita nei parametri deve avere un valore dello stesso tipo di questa proprietà.",
	"wbqc-violation-message-format": "Il valore della proprietà deve corrispondere al modello definito nei parametri.",
	"wbqc-violation-message-inverse": "Questa proprietà deve essere utilizzata solo quando c'è una dichiarazione sull'entità che ha come valore che usa la proprietà definita nei parametri e questo elemento come valore.",
	"wbqc-violation-message-item-property": "Questa proprietà deve essere utilizzata solo quando c'è un'altra dichiarazione che usa la proprietà definita nei parametri.",
	"wbqc-violation-message-item-claim": "Questa proprietà deve essere utilizzata solo quando c'è un'altra dichiarazione che usa la proprietà con uno dei valori definiti nei parametri.",
	"wbqc-violation-message-mandatory-qualifiers": "Tutte le proprietà definite nei parametri devono essere utilizzate come qualificatori di questa dichiarazione.",
	"wbqc-violation-message-multi-value": "Questa proprietà deve avere valori multipli. Cioè, ci devono essere più di un'asserzione che utilizza questa proprietà.",
	"wbqc-violation-message-one-of": "Il valore della proprietà deve essere uno degli elementi definiti nei parametri.",
	"wbqc-violation-message-qualifier": "La proprietà deve essere usata solo come qualificatore.",
	"wbqc-violation-message-qualifiers": "La proprietà deve essere utilizzata solo con (e con nessun altro) i qualificatori definiti nei parametri.",
	"wbqc-violation-message-range-properties-needed": "Proprietà con valori di tipo \"$1\" con vincolo di \"Intervallo\" necessitano di parametri \"$2\".",
	"wbqc-violation-message-range": "Il valore della proprietà non deve essere inferiore al valore minimo, né superiore al limite massimo definito nei parametri.",
	"wbqc-violation-message-single-value": "Questa proprietà deve avere un singolo valore. Cioè, ci deve essere solo un'asserzione che utilizza questa proprietà.",
	"wbqc-violation-message-symmetric": "Questa proprietà deve essere utilizzata solo quando c'è una dichiarazione sull'entità che ha come valore che usa la stessa proprietà e questo elemento come valore.",
	"wbqc-violation-message-type-relation-instance-or-subclass": "Il parametro \"relazione\" deve essere \"istanza\" o \"sottoclasse\".",
	"wbqc-violation-message-type": "Questa proprietà deve essere utilizzata solo su elementi che sono in relazione con l'elemento (o di una sottoclasse dell'elemento) definito nei parametri.",
	"wbqc-violation-message-target-required-claim-property": "Questa proprietà deve essere utilizzata solo quando c'è una dichiarazione sull'entità che ha come valore che usa la proprietà definita nei parametri.",
	"wbqc-violation-message-target-required-claim-claim": "Questa proprietà deve essere utilizzata solo quando c'è una dichiarazione sull'entità che ha come valore che usa la proprietà con uno dei valori definiti nei parametri.",
	"wbqc-violation-message-value-type": "L'entità che ha come valore questa proprietà deve essere in relazione con l'elemento (o di una sottoclasse dell'elemento) definito nei parametri."
}
