{
	"@metadata": {
		"authors": [
			"Abián",
			"Alifakoor",
			"Amire80",
			"BaRaN6161 TURK",
			"Liuxinyu970226",
			"Lucas Werkmeister (WMDE)",
			"Metalhead64",
			"MuratTheTurkish",
			"Raymond",
			"Robby",
			"Verdy p"
		]
	},
	"wbqc-constraintreport": "{{doc-special|ConstraintReport}}",
	"wbqc-desc": "{{desc|name=Wikibase Quality Constraints|url=https://www.mediawiki.org/wiki/Extension:WikibaseQualityConstraints}}",
	"wbqc-constraintreport-explanation-part-one": "Explanation (part one), what this special page does and how it gets its data.",
	"wbqc-constraintreport-explanation-part-two": "Explanation (part two), what this special page does and how it gets its data.",
	"wbqc-constraintreport-form-section": "Header of the section of the entity id form.",
	"wbqc-constraintreport-form-submit-label": "Label of the button, that starts the check.\n{{Identical|Check}}",
	"wbqc-constraintreport-form-entityid-label": "Label for the entity id input field.",
	"wbqc-constraintreport-form-entityid-placeholder": "Entity id placeholder for the input field.",
	"wbqc-constraintreport-result-headline": "Result headline. Label of checked entity is appended to this.",
	"wbqc-constraintreport-invalid-entity-id": "Text to display when the entered entity id is invalid.",
	"wbqc-constraintreport-not-existent-entity": "Text to display when the requested entity does not exist.",
	"wbqc-constraintreport-empty-result": "Message that appears, when there are no constraints defined for the given entity.",
	"wbqc-constraintreport-status-violation": "Status for claims that are violated against a constraint.",
	"wbqc-constraintreport-status-compliance": "Status for claims that comply with a constraint",
	"wbqc-constraintreport-status-exception": "Status for claims that were marked as a exception",
	"wbqc-constraintreport-status-todo": "Status for constraints which cannot be checked yet.\n{{Identical|Todo}}",
	"wbqc-constraintreport-status-bad-parameters": "Status for constraints that have missing or invalid constraint parameters.",
	"wbqc-constraintreport-status-deprecated": "Status for constraint checks that have been skipped because the statement is deprecated.",
	"wbqc-constraintreport-status-warning": "Status for statements that violate a non-mandatory constraint.\n{{Identical|Warning}}",
	"wbqc-constraintreport-status-suggestion": "Status for statements that violate a suggestion constraint.",
	"wbqc-constraintreport-status-not-in-scope": "Status for constraint checks that have been skipped because the kind of the snak to be checked (main snak, qualifier, or reference) is not within the scope of the constraint. This should follow the label of the “constraint scope” property ([[wikidata:Property:P4680|P4680 on Wikidata]]).",
	"wbqc-constraintreport-result-table-header-status": "Header of the column that tells whether the check found a violation or something else.\n{{Identical|Status}}",
	"wbqc-constraintreport-result-table-header-property": "Header of the column that shows the property of the constraint check. The constraint being checked is defined on this property.\n{{Identical|Property}}",
	"wbqc-constraintreport-result-table-header-message": "Header of the column that displays the message of a constraint check result.\n{{Identical|Message}}",
	"wbqc-constraintreport-result-table-header-constraint": "Header of the column that gives information about which constraint was checked.\n{{Identical|Constraint}}",
	"wbqc-constraintreport-result-link-to-claim": "Text for the link to a claim group on the entity page.",
	"wbqc-constraintreport-result-link-to-constraint": "Text for the link to a constraint on the property page.",
	"wbqc-constraintreport-no-parameter": "Text that is displayed when there was no value for a parameter given.\n{{Identical|None}}",
	"wbqc-issues-short": "Headline of the constraint report popup section for violations of mandatory constraints. These issues/problems are more severe than violations of non-mandatory constraints, which have the heading {{msg-mw|wbqc-potentialissues-short}}.\n{{Identical|Issue}}",
	"wbqc-issues-long": "Title for the icon shown on statements with mandatory constraint violations, usually displayed by the browser when the user hovers over the icon with the mouse cursor.",
	"wbqc-potentialissues-short": "Headline of the constraint report popup section for violations of non-mandatory constraints. Should be easy to understand for users, and convey that the reported violations are not always errors, but should be thought of as hints to the user that something might be wrong.",
	"wbqc-potentialissues-long": "Title for the icon shown on statements with non-mandatory constraint violations, usually displayed by the browser when the user hovers over the icon with the mouse cursor.\n{{Related|wbqc-potentialissues-short}}\n{{Related|wbqc-issues-long}}",
	"wbqc-suggestions-short": "Headline of the constraint report popup section for violations of suggestion constraints. Should be easy to understand for users, and convey that the reported violations are just suggestions for improvements to the statement, not indications of problems.",
	"wbqc-suggestions-long": "Title for the icon shown on statements with suggestion constraint violations, usually displayed by the browser when the user hovers over the icon with the mouse cursor.\n{{Related|wbqc-suggestions-short}}\n{{Related|wbqc-issues-long}}",
	"wbqc-badparameters-short": "Headline of the constraint parameter report popup shown on constraint statements with invalid constraint parameters.",
	"wbqc-badparameters-long": "Title for the icon shown on constraint statements with invalid constraint parameters, usually displayed by the browser when the user hovers over the icon with the mouse cursor.\n{{Related|wbqc-badparameters-short}}",
	"wbqc-parameterissues-short": "Headline of the section of the constraint parameter report popup that contains problems about the constraint parameters. The section is collapsed by default, since these problems are harder to understand and fix than normal constraint violations. The headline should convey that normal users are not expected to deal with these problems.\n\nThese problems are also displayed on property pages in a separate popup: see {{msg-mw|wbqc-badparameters-short}} / {{msg-mw|wbqc-badparameters-long}}.",
	"wbqc-parameterissues-long": "Longer explanation of the section of the constraint parameter report popup that contains problems about the constraint parameters.\n{{Related|wbqc-parameterissues-short}}",
	"wbqc-constrainttypehelp-short": "Text for the help link shown next to the constraint type in a constraint violation report. The link leads to a help page on Wikidata about the constraint type.\n{{Identical|Help}}",
	"wbqc-constrainttypehelp-long": "Title for the help link shown next to the constraint type in a constraint violation report. The link leads to a help page on Wikidata about the constraint type.\n{{Related|wbqc-constrainttypehelp-short}}",
	"wbqc-constraintdiscuss-short": "Text for the discussion link shown next to the constraint type in a constraint violation report. The link leads to the talk page of the property on which the constraint is defined.\n{{Identical|Discuss}}",
	"wbqc-constraintdiscuss-long": "Title for the discussion link shown next to the constraint type in a constraint violation report. The link leads to the talk page of the property on which the constraint is defined.\n{{Related|wbqc-constraintdiscuss-short}}",
	"wbqc-cached-generic": "Generic message informing the user that a constraint check result might be outdated. There is no information on how old the cached result is; if more information is available, a more specific message is used.",
	"wbqc-cached-minutes": "Message informing the user that a constraint check result might be outdated by up to ''n'' minutes.\n{{Related|wbqc-cached-generic}}",
	"wbqc-cached-hours": "Message informing the user that a constraint check result might be outdated by up to ''n'' hours.\n{{Related|Wbqc-cached}}",
	"wbqc-cached-days": "Message informing the user that a constraint check result might be outdated by up to ''n'' days.\n{{Related|wbqc-cached-minutes}}\n{{Related|wbqc-cached-generic}}",
	"wbqc-dataValueType-wikibase-entityid": "The name of a data value type.\n{{related|Wbqc-dataValueType-wikibase}}",
	"wbq-subextension-name-wbqc": "Name of this subextension. Is shown in special page that lists all the violations.\n{{Identical|Constraint}}",
	"wbqc-violation-header-parameters": "Header for section in violations special page that displays the parameters of the constraint.\n{{Identical|Parameter}}",
	"wbqc-violations-group": "Type of violations this extension finds.\n{{Identical|Constraint}}",
	"wbqc-violation-message": "Generic message to tell that there was a violation.",
	"wbqc-violation-message-not-yet-implemented": "Message for when a check is yet to be implemented. Not actually a violation, more of a todo.",
	"wbqc-violation-message-security-reason": "Message for when a check is not possible due to security reasons. Not actually a violation, more of a todo.",
	"wbqc-violation-message-value-needed-of-type": "Message for when a property needs a value of a specific type (like string or wikibase-entityid), but it doesn't.",
	"wbqc-violation-message-value-needed-of-types-2": "Message for when a property needs a value of one of two specific types (like string or wikibase-entityid), but it doesn't.",
	"wbqc-violation-message-parameter-needed": "Message for when a constraint needs a specific parameter, but it's missing.",
	"wbqc-violation-message-parameters-needed-3": "Message for when a constraint needs three specific parameters, but some of them are missing.",
	"wbqc-violation-message-target-entity-must-exist": "Message for when an entity is referenced, but it doesn't exist (any more).",
	"wbqc-violation-message-value-entity-must-exist": "Message for when the property has an entity as its value, but it doesn't exist (any more).",
	"wbqc-violation-message-parameter-value": "Message for when \"no value\" or \"unknown value\" has been entered as the value of a constraint parameter that must be an actual value. $1 contains the parameter.",
	"wbqc-violation-message-parameter-value-or-novalue": "Message for when \"unknown value\" has been entered as the value of a constraint parameter that must be an actual value or \"no value\". $1 contains the parameter.\n{{Related|wbqc-violation-message-parameter-value}}",
	"wbqc-violation-message-parameter-entity": "Message for when the value of a constraint parameter must be an entity, but is some other kind of data value. $1 contains the parameter, $2 the value.",
	"wbqc-violation-message-parameter-item": "Message for when the value of a constraint parameter must be an item, but is some other kind of entity. $1 contains the parameter, $2 the value.\n{{Related|wbqc-violation-message-parameter-entity}}",
	"wbqc-violation-message-parameter-property": "Message for when the value of a constraint parameter must be a property, but is some other kind of entity. $1 contains the parameter, $2 the value.\n{{Related|wbqc-violation-message-parameter-entity}}",
	"wbqc-violation-message-parameter-string": "Message for when the value of a constraint parameter must be a string, but is some other value type. $1 contains the parameter, $2 the value.",
	"wbqc-violation-message-parameter-monolingualtext": "Message for when the value of a constraint parameter must be a monolingual text, but is some other value type. Parameters:\n* $1 contains the parameter.\n* $2 contains the value.",
	"wbqc-violation-message-parameter-single": "Message for when a constraint parameter has multiple values but only supports one. $1 contains the parameter.",
	"wbqc-violation-message-parameter-single-per-language": "Message for when a constraint parameter has multiple values with the same language but only supports one value per language. (This is, in effect, used to construct a multilingual text from several monolingual texts.) Parameters:\n* $1 is the parameter.\n* $2 is the language name in the language itself (autonym), e. g. “English” or “français cadien” (without any quotation marks).\n* $3 is the language code, e. g. en or frc.\n{{Related|wbqc-violation-message-parameter-single}}",
	"wbqc-violation-message-parameter-oneof": "Message for when a constraint parameter must be one of several values, but is something different. $1 contains the parameter, $2 the number of allowed values (possibly 1), $3 an HTML list of all allowed values, and $4, $5 etc. are the individual allowed values.\n{{Related|wbqc-violation-message-one-of}}",
	"wbqc-violation-message-parameter-regex": "Message for when a constraint parameter must be a valid regular expression, but has an error. $1 contains the parameter value.",
	"wbqc-violation-message-sparql-error": "Message for when a constraint checker runs a SPARQL query but the SPARQL endpoint returns an error instead of query results.",
	"wbqc-violation-message-parameters-error-unknown": "Message for when the constraint parameters of a constraint could not be imported, but the reason is unknown.n",
	"wbqc-violation-message-parameters-error-toolong": "Message for when the constraint parameters of a constraint could not be imported because they were too long to be stored in the database.",
	"wbqc-violation-message-invalid-scope": "Message for when a constraint specifies a scope that is not valid for this constraint type, such as a “constraint checked on qualifiers” scope on a “used as reference” constraint. Parameters:\n* $1 is the invalid scope.\n* $2 is the constraint type.\n* $3 is the number of valid scopes.\n* $4 is an HTML list of all valid scopes for this constraint type.\n* $5, $6 etc. are the individual valid scopes for this constraint type.\nThis should follow the label of the “constraint scope” property ([[wikidata:Property:P4680|P4680 on Wikidata]]), similar to {{msg-mw|wbqc-constraintreport-status-not-in-scope}}.",
	"wbqc-violation-message-commons-link-no-existent": "Message for violation of Commons link constraint. When linked commons page does not exist.",
	"wbqc-violation-message-commons-link-not-well-formed": "Message for violation of Commons link constraint. When link contains invalid characters.",
	"wbqc-violation-message-commons-link-check-for-namespace-not-yet-implemented": "Message for when the check for the Commons link constraint has not yet been implemented for a specific namespace.",
	"wbqc-violation-message-conflicts-with-property": "Message for a violation of the “Conflicts with” constraint, when there is a statement with a conflicting property. $1 contains the property of the current statement (which has the constraint), and $2 contains the conflicting property.",
	"wbqc-violation-message-conflicts-with-claim": "Message for a violation of the “Conflicts with” constraint, when there is a conflicting statement. $1 contains the property of the current statement (which has the constriant), $2 contains the property of the conflicting statement, and $3 contains the value of the conflicting statement.\n{{Related|Wbqc-violation-message-conflicts-with-property}}",
	"wbqc-violation-message-contemporary-subject-earlier": "Message for a violation of the “Contemporary” constraint, when the linked entities are not contemporary. Parameters:\n* $1 is the subject entity.\n* $2 is the property of the statement with the constraint.\n* $3 is the value entity.\n* $4 is the end time value of the subject entity.\n* $5 is the start time value of the value entity.\n{{Related|Wbqc-violation-message-contemporary-subject-earlier}}",
	"wbqc-violation-message-contemporary-value-earlier": "Message for a violation of the “Contemporary” constraint, when the linked entities are not contemporary. Parameters:\n* $1 is the subject entity.\n* $2 is the property of the statement with the constraint.\n* $3 is the value entity.\n* $4 is the end time value of the value entity.\n* $5 is the start time value of the subject entity.\n{{Related|Wbqc-violation-message-contemporary-subject-earlier}}",
	"wbqc-violation-message-diff-within-range": "Message for a violation of the “Diff within range” constraint, when the difference between two values is smaller or larger than allowed (for a range with both limits). Parameters:\n* $1 is the first property.\n* $2 is the value of the first property.\n* $3 is the second property.\n* $4 is the value of the second property.\n* $5 is the lower bound of the range (inclusive).\n* $6 is the upper bound of the range (inclusive).\nThe “first property” is the one referenced in the constraint, and the “second property” is the one that the constraint is placed on. The difference is calculated as “second property” − “first property” ($4 − $2).",
	"wbqc-violation-message-diff-within-range-leftopen": "Message for a violation of the “Diff within range” constraint, when the difference between two values is larger than allowed (for a range with an upper but no lower limit). Parameters:\n* $1 is the first property.\n* $2 is the value of the first property.\n* $3 is the second property.\n* $4 is the value of the second property.\n* $5 is the upper bound of the range (inclusive).\nThe “first property” is the one referenced in the constraint, and the “second property” is the one that the constraint is placed on. The difference is calculated as “second property” − “first property” ($4 − $2).\n{{Related|wbqc-violation-message-diff-within-range}}",
	"wbqc-violation-message-diff-within-range-rightopen": "Message for a violation of the “Diff within range” constraint, when the difference between two values is larger than allowed (for a range with a lower but no upper limit). Parameters:\n* $1 is the first property.\n* $2 is the value of the first property.\n* $3 is the second property.\n* $4 is the value of the second property.\n* $5 is the lower bound of the range (inclusive).\nThe “first property” is the one referenced in the constraint, and the “second property” is the one that the constraint is placed on. The difference is calculated as “second property” − “first property” ($4 − $2).\n{{Related|wbqc-violation-message-diff-within-range}}",
	"wbqc-violation-message-diff-within-range-must-have-equal-types": "Message for violation of Diff within range constraint. When this and the given property differ in value type.",
	"wbqc-violation-message-format": "Message for a violation of the “Format” constraint, when the value of a statement does not match a certain pattern (“regex” is short for “regular expression”). Parameters:\n* $1 is the property of the statement that has the constraint.\n* $2 is the text value of the statement.\n* $3 is the regex.\nThis message is only used if no syntax clarification for the regex has been provided; if a syntax clarification is available, {{msg-mw|wbqc-violation-message-format-clarification}} is used instead.",
	"wbqc-violation-message-format-clarification": "Message for a violation of the “Format” constraint, when the value of a statement does not match a certain pattern (“regex” is short for “regular expression”). Parameters:\n* $1 is the property of the statement that has the constraint.\n* $2 is the text value of the statement.\n* $3 is the regex.\n* $4 is a human-readable explanation of the regex in the user’s language or a fallback language (possibly English).\n{{Related|wbqc-violation-message-format}}",
	"wbqc-violation-message-inverse": "Message for a violation of the “Inverse” constraint, when the inverse statement of a statement does not exist. $1, $2 and $3 contain the expected subject entity, property, and target entity of the missing inverse statement.",
	"wbqc-violation-message-item": "Message for a violation of the “Item” constraint, when the subject entity of a statement is missing another statement. Parameters:\n* $1 is the property of the statement that has the constraint.\n* $2 is the property of the missing statement.\n* $3 is the number of values permitted for the missing statement (or 0, in which case the constraint only specifies that there should be a statement but not the values it should have).\n* $4 is an HTML list of all values permitted for the missing statement.\n* $5, $6 etc. are the individual values permitted for the missing statement.\n{{Related|wbqc-violation-message-target-required-claim}}",
	"wbqc-violation-message-mandatory-qualifier": "Message for a violation of the “Mandatory qualifier” constraint, when a mandatory qualifier is missing on a statement. Parameters:\n* $1 is the property of the statement.\n* $2 is the missing qualifier.",
	"wbqc-violation-message-multi-value": "Message for a violation of the “multi value” constraint, when only one value exists. Parameters:\n* $1 is the property of the statement.",
	"wbqc-violation-message-multi-value-separators": "Message for a violation of the “multi value” constraint, when only one value with the same set of qualifiers exists. Parameters:\n* $1 is the property of the statement.\n* $2 is the number of separator properties.\n* $3 is an HTML list of all separator properties.\n* $4, $5 etc. are the individual separator properties.",
	"wbqc-violation-message-one-of": "Message for a violation of the “One of” constraint, when the value is not one of the allowed values. Parameters:\n* $1 is the property that has the constraint.\n* $2 is the number of allowed values (note that certain constraints have only a single allowed value).\n* $3 is an HTML list of all allowed values.\n* $4, $5 etc. are the individual allowed values.",
	"wbqc-violation-message-qualifier": "Message for violation of Qualifier constraint. When the property is used in a claim.",
	"wbqc-violation-message-no-qualifiers": "Message for a violation of the “Qualifiers” constraint, when a statement has a qualifier but the property has no permitted qualifiers. This is a special case of {{msg-mw|wbqc-violation-message-qualifiers}}. Parameters:\n* $1 is the qualifier property that is not permitted.\n{{Related|wbqc-violation-message-qualifiers}}",
	"wbqc-violation-message-qualifiers": "Message for a violation of the “Qualifiers” constraint, when a statement has a qualifier that is not permitted. Parameters:\n* $1 is the property of the statement.\n* $2 is the qualifier property that is not permitted.\n* $3 is the number of permitted qualifiers. (This number is always greater than zero, since the special case of no permitted qualifiers is handled by the separate message {{msg-mw|wbqc-violation-message-no-qualifiers}}.)\n* $4 is an HTML list of all permitted qualifiers.\n* $5, $6 etc. are the individual permitted qualifiers.\n{{Related|wbqc-violation-message-no-qualifiers}}",
	"wbqc-violation-message-range-parameters-needed": "Message for when a constraint needs two specific parameters to form a range, but one or both of them are missing. Parameters:\n* $1 is the data type (\"quantity\" or \"time\").\n* $2 is the parameter needed for the lower boundary.\n* $3 is the parameter needed for the upper boundary.\n* $4 is the constraint type name (\"Range\" or \"Diff within range\").",
	"wbqc-violation-message-range-parameters-one-year": "Message for when a constraint has two parameters to form a range, and one of the parameters has the unit “year” and the other one has a different unit (e. g. “seconds”). Because years cannot be losslessly converted to other time units (due to leap years), this is not allowed: either both range endpoints should have the unit “year”, or both should have a different unit.",
	"wbqc-violation-message-range-parameters-same": "Message for when the valid range defined by two constraint parameters is empty because the two parameters contain the same value. Special cases of this message are ranges open on both sides (no lower and no upper boundary), or ranges where both endpoints are the special value “now”. Parameters: \n* $1 is the parameter for the lower boundary of the range.\n* $2 is the parameter for the upper boundary of the range.",
	"wbqc-violation-message-range-quantity-closed": "Message for a violation of the “Range” constraint, when the value of a statement is smaller or larger than allowed (for a quantity range with both limits). Parameters:\n* $1 is the property of the statement.\n* $2 is the value of the statement.\n* $3 is the lower bound of the range (inclusive).\n* $4 is the upper bound of the range (inclusive).",
	"wbqc-violation-message-range-quantity-leftopen": "Message for a violation of the “Range” constraint, when the value of a statement is larger than allowed (for a quantity range with an upper but no lower limit). Parameters:\n* $1 is the property of the statement.\n* $2 is the value of the statement.\n* $3 is the upper bound of the range (inclusive).",
	"wbqc-violation-message-range-quantity-rightopen": "Message for a violation of the “Range” constraint, when the value of a statement is smaller than allowed (for a quantity range with a lower but no upper limit). Parameters:\n* $1 is the property of the statement.\n* $2 is the value of the statement.\n* $3 is the lower bound of the range (inclusive).",
	"wbqc-violation-message-range-time-closed": "Message for a violation of the “Range” constraint, when the value of a statement is earlier or later than allowed (for a time range with both limits). Parameters:\n* $1 is the property of the statement.\n* $2 is the value of the statement.\n* $3 is the lower bound of the range (inclusive).\n* $4 is the upper bound of the range (inclusive).",
	"wbqc-violation-message-range-time-closed-leftnow": "Message for a violation of the “Range” constraint, when the value of a statement is earlier or later than allowed (for a time range with both limits, where the lower (left) limit is the current day). Parameters:\n* $1 is the property of the statement.\n* $2 is the value of the statement.\n* $3 is the upper bound of the range (inclusive).",
	"wbqc-violation-message-range-time-closed-rightnow": "Message for a violation of the “Range” constraint, when the value of a statement is earlier or later than allowed (for a time range with both limits, where the upper (right) limit is the current day). Parameters:\n* $1 is the property of the statement.\n* $2 is the value of the statement.\n* $3 is the lower bound of the range (inclusive).",
	"wbqc-violation-message-range-time-leftopen": "Message for a violation of the “Range” constraint, when the value of a statement is later than allowed (for a time range with an upper but no lower limit). Parameters:\n* $1 is the property of the statement.\n* $2 is the value of the statement.\n* $3 is the upper bound of the range (inclusive).",
	"wbqc-violation-message-range-time-leftopen-rightnow": "Message for a violation of the “Range” constraint, when the value of a statement is later than allowed (for a time range with no lower limit and the current day as the upper limit). Parameters:\n* $1 is the property of the statement.\n* $2 is the value of the statement.\n{{Related|wbqc-violation-message-range-time-leftopen}}\n{{Related|wbqc-violation-message-range-time-rightopen-leftnow}}",
	"wbqc-violation-message-range-time-rightopen": "Message for a violation of the “Range” constraint, when the value of a statement is earlier than allowed (for a time range with a lower but no upper limit). Parameters:\n* $1 is the property of the statement.\n* $2 is the value of the statement.\n* $3 is the lower bound of the range (inclusive).",
	"wbqc-violation-message-range-time-rightopen-leftnow": "Message for a violation of the “Range” constraint, when the value of a statement is earlier than allowed (for a time range with no upper limit and the current day as the lower limit). Parameters:\n* $1 is the property of the statement.\n* $2 is the value of the statement.\n{{Related|wbqc-violation-message-range-time-rightopen}}\n{{Related|wbqc-violation-message-range-time-leftopen-rightnow}}",
	"wbqc-violation-message-single-value": "Message for a violation of the “single value” constraint, when more than one value exists. Parameters:\n* $1 is the property of the statement.",
	"wbqc-violation-message-single-value-separators": "Message for a violation of the “single value” constraint, when more than one value with the same set of qualifiers exists. Parameters:\n* $1 is the property of the statement.\n* $2 is the number of separator properties.\n* $3 is an HTML list of all separator properties.\n* $4, $5 etc. are the individual separator properties.",
	"wbqc-violation-message-single-best-value-no-preferred": "Message for a violation of the “Single best value” constraint, when there are multiple statements and none of them have preferred rank.",
	"wbqc-violation-message-single-best-value-no-preferred-separators": "Message for a violation of the “Single best value” constraint, when there are multiple statements with the same set of qualifiers and none of them have preferred rank. Parameters:\n* $1 is the property of the statement.\n* $2 is the number of separator properties.\n* $3 is an HTML list of all separator properties.\n* $4, $5 etc. are the individual separator properties.",
	"wbqc-violation-message-single-best-value-multi-preferred": "Message for a violation of the “Single best value” constraint, when there are multiple statements with preferred rank.",
	"wbqc-violation-message-single-best-value-multi-preferred-separators": "Message for a violation of the “Single best value” constraint, when there are multiple statements with the same set of qualifiers and with preferred rank. Parameters:\n* $1 is the property of the statement.\n* $2 is the number of separator properties.\n* $3 is an HTML list of all separator properties.\n* $4, $5 etc. are the individual separator properties.",
	"wbqc-violation-message-symmetric": "Message for a violation of the “Symmetric” constraint, when the symmetric statement of a statement does not exist. $1, $2 and $3 contain the expected subject entity, property, and target entity of the missing symmetric statement.",
	"wbqc-violation-message-type-instance": "Message for a violation of the “Type” constraint, when the subject of a statement should be an instance of a certain type but isn't. $1 is the property of the statement, $2 is the subject of the statement, $3 is the number of classes, $4 is an HTML list of all classes, and $5, $6 etc. are the individual classes.\n{{Related|wbqc-violation-message-type-instance}}",
	"wbqc-violation-message-type-subclass": "Message for a violation of the “Type” constraint, when the subject of a statement should be a subclass of a certain type but isn't. $1 is the property of the statement, $2 is the subject of the statement, $3 is the number of classes, $4 is an HTML list of all classes, and $5, $6 etc. are the individual classes.\n{{Related|wbqc-violation-message-type-instance}}",
	"wbqc-violation-message-type-instanceOrSubclass": "Message for a violation of the “Type” constraint, when the subject of a statement should be an instance or a subclass of a certain type but isn't. $1 is the property of the statement, $2 is the subject of the statement, $3 is the number of classes, $4 is an HTML list of all classes, and $5, $6 etc. are the individual classes.\n{{Related|wbqc-violation-message-type-instance}}",
	"wbqc-violation-message-valueType-instance": "Message for a violation of the “Value type” constraint, when the value of a statement should be an instance of a certain type but isn't. $1 is the property of the statement, $2 is the value of the statement, $3 is the number of classes, $4 is an HTML list of all classes, and $5, $6 etc. are the individual classes.\n{{Related|wbqc-violation-message-valueType-instance}}",
	"wbqc-violation-message-valueType-subclass": "Message for a violation of the “Value type” constraint, when the value of a statement should be a subclass of a certain type but isn't. $1 is the property of the statement, $2 is the value of the statement, $3 is the number of classes, $4 is an HTML list of all classes, and $5, $6 etc. are the individual classes.\n{{Related|wbqc-violation-message-valueType-instance}}",
	"wbqc-violation-message-valueType-instanceOrSubclass": "Message for a violation of the “Value type” constraint, when the value of a statement should be an instance or a subclass of a certain type but isn't. $1 is the property of the statement, $2 is the value of the statement, $3 is the number of classes, $4 is an HTML list of all classes, and $5, $6 etc. are the individual classes.\n{{Related|wbqc-violation-message-valueType-instance}}",
	"wbqc-violation-message-target-required-claim": "Message for a violation of the “Target required claim” constraint, when the target entity of a statement is missing an expected statement. Parameters:\n* $1 is the subject entity of the missing statement, i. e. the target entity of the statement that has the constraint.\n* $2 is the property of the missing statement.\n* $3 is the number of values permitted for the missing statement (or 0, in which case the constraint only specifies that there should be a statement but not the values it should have).\n* $4 is an HTML list of all values permitted for the missing statement.\n* $5, $6 etc. are the individual values permitted for the missing statement.\n{{Related|wbqc-violation-message-item}}",
	"wbqc-violation-message-unique-value": "Message for violation of the Unique Value constraint, when other items are found. Parameters:\n* $1 is the number of other items with the same value.\n* $2 is an HTML list of all other items found with the same value.\n* $3, $4 etc. are the individual other items with the same value.",
	"wbqc-violation-message-valueOnly": "Message for a violation of the “used for values only” constraint, when a property intended for the main value only was used in a qualifier or reference.\n{{Related|Wbqc-violation-message-valueOnly}}",
	"wbqc-violation-message-reference": "Message for a violation of the “used as reference” constraint, when a property intended for references only was used for the main value or in a qualifier.\n{{Related|Wbqc-violation-message-valueOnly}}",
	"wbqc-violation-message-noBounds": "Message for a violation of the “no bounds” constraint, when a property intended to have unbounded quantities as its value. Parameters:\n* $1 is the property which has the constraint.",
	"wbqc-violation-message-units-none": "Message for a violation of the “allowed units” constraint, when a property should not be used with any units but the value has a unit. Parameters:\n* $1 is the property ID of the property to which the constraint applies.\n{{Related|Wbqc-violation-message-units-none}}",
	"wbqc-violation-message-units": "Message for a violation of the “allowed units” constraint, when a property should be used with a certain set of units but the value has a different unit or is unitless. Parameters:\n* $1 is the property ID of the property to which the constraint applies.\n* $2 is the number of allowed units.\n* $3 is an HTML list of all allowed units.\n* $4, $5 etc. are the individual allowed units.\n{{Related|Wbqc-violation-message-units-none}}",
	"wbqc-violation-message-units-or-none": "Message for a violation of the “allowed units” constraint, when a property should be used with a certain set of units (including “no value”, permitting unitless values) but the value has a different unit. Parameters:\n* $1 is the property ID of the property to which the constraint applies.\n* $2 is the number of allowed units.\n* $3 is an HTML list of all allowed units.\n* $4, $5 etc. are the individual allowed units.",
	"wbqc-violation-message-entityType": "Message for a violation of the “entity type” constraint, when a property should only be used in limited number entity types and not all. Parameters:\n* $1 is the property which has the constraint.\n* $2 is the number of acceptable entity types.\n* $3 is an HTML list of all acceptable entity types.\n* $4, $5 etc. are the individual acceptable entity types.",
	"wbqc-violation-message-none-of": "Message for a violation of the “none of” constraint, when the value is one of the disallowed values. Parameters:\n* $1 is the property of the statement.\n* $2 the number of disallowed values (note that certain constraints might have only a single disallowed value).\n* $3 is an HTML list of all disallowed values.\n* $4, $5 etc. are the individual disallowed values.",
	"wbqc-violation-message-integer": "Message for a violation of the “integer” constraint, when a property should have integer quantities as its value but the value is not integer. Parameters:\n* $1 is the property which has the constraint.\n* $2 is the value of the statement.",
	"wbqc-violation-message-integer-bounds": "Message for a violation of the “integer” constraint, when a property should have integer quantities as its value and the value is integer but its bounds are not (for example: 10±0.5). Parameters:\n* $1 is the property which has the constraint.\n* $2 is the value of the statement.",
	"wbqc-violation-message-citationNeeded": "Message for a violation of the “citation needed” constraint, when a property intended to have at least one reference for its values. Parameters:\n* $1 is the property which has the constraint.",
	"wbqc-violation-message-language": "Message for a violation of the “lexeme language” constraint, when property can be used only on lexemes with language set to a limited number of values. Parameters:\n* $1 is the property of the statement.\n* $2 the number of languages allowed.\n* $3 is an HTML list of all languages.\n* $4, $5 etc. are the individual languages.",
	"wbqc-violation-message-label-lacking": "Message for a violation of the “label in language” constraint, when property can be used only on entities having label at least in those languages. Parameters:\n* $1 is the property of the statement.\n* $2 the number of languages required.\n* $3 is an HTML list of all languages.\n* $4, $5 etc. are the individual languages.",
	"wbqc-violation-message-property-scope": "Message for a violation of the “property scope” constraint, when a property has been used in a location where it is not intended to be used.\n\nThere are three types of locations, each represented by an item:\n* the main value of a statement\n* the qualifiers of a statement\n* the references of a statement\nPlease avoid phrasing the message in a way that depends on the labels of those items, since they may change in the future (i.&nbsp;e., don’t try to use them to build full sentences, even though the current labels might allow it).\n\nParameters:\n* $1 is the property that has been used in an unexpected location.\n* $2 is the location where the property was found.\n* $3 is the number of allowed locations for the property.\n* $4 is an HTML list of all allowed locations for the property.\n* $5, $6 etc. are the individual allowed locations for the property.",
	"wbqc-violation-message-exception": "Message for a constraint check result on an entity that has been marked as an exception to the constraint. This message only appears on [[Special:ConstraintReport]]; the gadget does not show exception reports."
}
