{
	"@metadata": {
		"authors": [
			"Liuxinyu970226",
			"Raymond",
			"Metalhead64",
			"Amire80"
		]
	},
	"wbqc-constraintreport": "{{doc-special|ConstraintReport}}",
	"wbqc-desc": "{{desc|name=Wikibase Quality Constraints|url=https://www.mediawiki.org/wiki/Extension:WikibaseQualityConstraints}}",
	"wbqc-constraintreport-explanation-part-one": "Explanation (part one), what this special page does and how it gets its data.",
	"wbqc-constraintreport-explanation-part-two": "Explanation (part two), what this special page does and how it gets its data.",
	"wbqc-constraintreport-form-section": "Header of the section of the entity id form.",
	"wbqc-constraintreport-form-submit-label": "Label of the button, that starts the check.\n{{Identical|Check}}",
	"wbqc-constraintreport-form-entityid-label": "Label for the entity id input field.",
	"wbqc-constraintreport-form-entityid-placeholder": "Entity id placeholder for the input field.",
	"wbqc-constraintreport-result-headline": "Result headline. Label of checked entity is appended to this.",
	"wbqc-constraintreport-invalid-entity-id": "Text to display when the entered entity id is invalid.",
	"wbqc-constraintreport-not-existent-entity": "Text to display when the requested entity does not exist.",
	"wbqc-constraintreport-empty-result": "Message that appears, when there are no constraints defined for the given entity.",
	"wbqc-constraintreport-status-violation": "Status for claims that are violated against a constraint.",
	"wbqc-constraintreport-status-compliance": "Status for claims that comply with a constraint",
	"wbqc-constraintreport-status-exception": "Status for claims that were marked as a exception",
	"wbqc-constraintreport-status-todo": "Status for constraints which cannot be checked yet.\n{{Identical|Todo}}",
	"wbqc-constraintreport-result-table-header-status": "Header of the column that tells whether the check found a violation or something else.\n{{Identical|Status}}",
	"wbqc-constraintreport-result-table-header-claim": "Header of the column that displays a link to the claim, the used property and its value.\n{{Identical|Claim}}",
	"wbqc-constraintreport-result-table-header-constraint": "Header of the column that gives information about which constraint was checked.\n{{Identical|Constraint}}",
	"wbqc-constraintreport-result-link-to-claim": "Text for the link to a claim group on the entity page.",
	"wbqc-constraintreport-result-link-to-constraint": "Text for the link to a constraint on the property page.",
	"wbqc-constraintreport-no-parameter": "Text that is displayed when there was no value for a parameter given.\n{{Identical|None}}",
	"wbqc-potentialissues-short": "Headline of the constraint report popup shown on statements with constraint violations. Should be easy to understand for users, and convey that the reported violations are not always errors, but should be thought of as hints to the user that something might be wrong.\n\n{{Related|wbqc-constraintreport}}",
	"wbqc-potentialissues-long": "Title for the icon shown on statements with constraint violations, usually displayed by the browser when the user hovers over the icon with the mouse cursor.{{Related|wbqc-potentialissues-short}}",
	"apihelp-wbcheckconstraints-description": "{{doc-apihelp-description|wbcheckconstraints}}",
	"apihelp-wbcheckconstraints-param-id": "{{doc-apihelp-param|wbcheckconstraints|id}}",
	"apihelp-wbcheckconstraints-param-claimid": "{{doc-apihelp-param|wbcheckconstraints|claimid}}",
	"apihelp-wbcheckconstraints-param-constraintid": "{{doc-apihelp-param|wbcheckconstraints|constraintid}}",
	"apihelp-wbcheckconstraints-example-1": "{{doc-apihelp-example|wbcheckconstraints}}",
	"apihelp-wbcheckconstraints-example-2": "{{doc-apihelp-example|wbcheckconstraints}}",
	"wbq-subextension-name-wbqc": "Name of this subextension. Is shown in special page that lists all the violations.\n{{Identical|Constraint}}",
	"wbqc-violation-header-parameters": "Header for section in violations special page that displays the parameters of the constraint.\n{{Identical|Parameter}}",
	"wbqc-violations-group": "Type of violations this extension finds.\n{{Identical|Constraint}}",
	"wbqc-violation-message": "Generic message to tell that there was a violation.",
	"wbqc-violation-message-not-yet-implemented": "Message for when a check is yet to be implemented. Not actually a violation, more of a todo.",
	"wbqc-violation-message-security-reason": "Message for when a check is not possible due to security reasons. Not actually a violation, more of a todo.",
	"wbqc-violation-message-value-needed": "Message for when a property needs a value (rather than no or some value), but hasn't.",
	"wbqc-violation-message-value-needed-of-type": "Message for when a property needs a value of a specific type (like string or wikibase-entityid), but it doesn't.",
	"wbqc-violation-message-value-needed-of-types-2": "Message for when a property needs a value of one of two specific types (like string or wikibase-entityid), but it doesn't.",
	"wbqc-violation-message-parameter-needed": "Message for when a constraint needs a specific parameter, but it's missing.",
	"wbqc-violation-message-parameters-needed-3": "Message for when a constraint needs three specific parameters, but some of them are missing.",
	"wbqc-violation-message-target-entity-must-exist": "Message for when an entity is referenced, but it doesn't exist (any more).",
	"wbqc-violation-message-value-entity-must-exist": "Message for when the property has an entity as its value, but it doesn't exist (any more).",
	"wbqc-violation-message-commons-link-no-existent": "Message for violation of Commons link constraint. When linked commons page does not exist.",
	"wbqc-violation-message-commons-link-not-well-formed": "Message for violation of Commons link constraint. When link contains invalid characters.",
	"wbqc-violation-message-commons-link-check-for-namespace-not-yet-implemented": "Message for when the check for the Commons link constraint has not yet been implemented for a specific namespace.",
	"wbqc-violation-message-conflicts-with-property": "Message for violation of Conflicts with constraint. When only a property is given.",
	"wbqc-violation-message-conflicts-with-claim": "Message for violation of Conflicts with constraint. When property and value are given.",
	"wbqc-violation-message-diff-within-range": "Message for violation of Diff within range constraint. When difference is smaller or larger than allowed.",
	"wbqc-violation-message-diff-within-range-property-must-exist": "Message for violation of Diff within range constraint. When given property does not exist (any more).",
	"wbqc-violation-message-diff-within-range-property-needs value": "Message for violation of Diff within range constraint. When given property does not have a value.",
	"wbqc-violation-message-diff-within-range-must-have-equal-types": "Message for violation of Diff within range constraint. When this and the given property differ in value type.",
	"wbqc-violation-message-format": "Message for violation of format constraint. When string does not match given pattern.",
	"wbqc-violation-message-inverse": "Message for a violation of the “Inverse” constraint, when the inverse statement of a statement does not exist. $1, $2 and $3 contain the expected subject entity, property, and target entity of the missing inverse statement.",
	"wbqc-violation-message-item-property": "Message for violation of Item constraint. When only a property is given.",
	"wbqc-violation-message-item-claim": "Message for violation of Item constraint. When property and value are given.",
	"wbqc-violation-message-mandatory-qualifiers": "Message for violation of Mandatory qualifiers constraint. When a qualifier is missing.",
	"wbqc-violation-message-multi-value": "Message for violation of Multi value constraint. When no more than one value exists.",
	"wbqc-violation-message-one-of": "Message for a violation of the “One of” constraint, when the value is not one of the allowed values. $1 is the property, $2 the number of allowed values (note that certain constraints have only a single allowed value), $3 an HTML list of all allowed values, and $4, $5 etc. are the individual allowed values.",
	"wbqc-violation-message-qualifier": "Message for violation of Qualifier constraint. When the property is used in a claim.",
	"wbqc-violation-message-qualifiers": "Message for violation of Qualifiers constraint. When a qualifier is not an allowed one.",
	"wbqc-violation-message-range-parameters-needed": "Message for violation of Range constraint. When min and max parameters of a specific type are needed, but missing.",
	"wbqc-violation-message-range": "Message for violation of Range constraint. When value is too small or too large.",
	"wbqc-violation-message-single-value": "Message for violation of Single value constraint. When more than one value exists.",
	"wbqc-violation-message-symmetric": "Message for a violation of the “Symmetric” constraint, when the symmetric statement of a statement does not exist. $1, $2 and $3 contain the expected subject entity, property, and target entity of the missing symmetric statement.",
	"wbqc-violation-message-type-relation-instance-or-subclass": "Message for violation of Type/Value type constraint. When relation is neither instance nor subclass.",
	"wbqc-violation-message-type": "Message for a violation of the “Type” or “Value type” constraint, when an entity (either the subject or the object of a statement) should have a certain type but doesn't. Parameters:\n* $1 is {{msg-mw|Wbqc-violation-message-type-entity-type}} or {{msg-mw|Wbqc-violation-message-type-entity-valueType}};\n* $2 is {{msg-mw|wbqc-violation-message-type-relation-instance}} or {{msg-mw|wbqc-violation-message-type-relation-subclass}};\n* $3 is the entity that doesn't have the required type;\n* $4 is the number of classes;\n* $5 is an HTML list of all classes;\n* and $6, $7 etc. are the individual classes.",
	"wbqc-violation-message-type-entity-type": "Fragment of {{msg-mw|wbqc-violation-message-type}} when the constraint is a “Type” constraint, and the entity that doesn't have the required type is the subject of the statement (the entity the statement is placed on). $1 is the property of the statement.",
	"wbqc-violation-message-type-entity-valueType": "Fragment of {{msg-mw|wbqc-violation-message-type}} when the constraint is a “Value type” constraint, and the entity that doesn't have the required type is the object (value) of the statement. $1 is the property of the statement.",
	"wbqc-violation-message-type-relation-instance": "Fragment of {{msg-mw|wbqc-violation-message-type}} when the relation is “instance”, and the entity should be an instance of one of the classes.",
	"wbqc-violation-message-type-relation-subclass": "Fragment of {{msg-mw|wbqc-violation-message-type}} when the relation is “instance”, and the entity should be a subclass of one of the classes.",
	"wbqc-violation-message-target-required-claim-property": "Message for violation of Target required claim constraint. When only a property is given.",
	"wbqc-violation-message-target-required-claim-claim": "Message for violation of Target required claim constraint. When property and value are given."
}
