{
	"@metadata": {
		"authors": [
			"Liuxinyu970226",
			"Raymond",
			"Metalhead64",
			"Amire80",
			"Robby"
		]
	},
	"wbqc-constraintreport": "{{doc-special|ConstraintReport}}",
	"wbqc-desc": "{{desc|name=Wikibase Quality Constraints|url=https://www.mediawiki.org/wiki/Extension:WikibaseQualityConstraints}}",
	"wbqc-constraintreport-explanation-part-one": "Explanation (part one), what this special page does and how it gets its data.",
	"wbqc-constraintreport-explanation-part-two": "Explanation (part two), what this special page does and how it gets its data.",
	"wbqc-constraintreport-form-section": "Header of the section of the entity id form.",
	"wbqc-constraintreport-form-submit-label": "Label of the button, that starts the check.\n{{Identical|Check}}",
	"wbqc-constraintreport-form-entityid-label": "Label for the entity id input field.",
	"wbqc-constraintreport-form-entityid-placeholder": "Entity id placeholder for the input field.",
	"wbqc-constraintreport-result-headline": "Result headline. Label of checked entity is appended to this.",
	"wbqc-constraintreport-invalid-entity-id": "Text to display when the entered entity id is invalid.",
	"wbqc-constraintreport-not-existent-entity": "Text to display when the requested entity does not exist.",
	"wbqc-constraintreport-empty-result": "Message that appears, when there are no constraints defined for the given entity.",
	"wbqc-constraintreport-status-violation": "Status for claims that are violated against a constraint.",
	"wbqc-constraintreport-status-compliance": "Status for claims that comply with a constraint",
	"wbqc-constraintreport-status-exception": "Status for claims that were marked as a exception",
	"wbqc-constraintreport-status-todo": "Status for constraints which cannot be checked yet.\n{{Identical|Todo}}",
	"wbqc-constraintreport-status-bad-parameters": "Status for constraints that have missing or invalid constraint parameters.",
	"wbqc-constraintreport-status-deprecated": "Status for constraint checks that have been skipped because the statement is deprecated.",
	"wbqc-constraintreport-status-warning": "Status for statements that violate a non-mandatory constraint.\n{{Identical|Warning}}",
	"wbqc-constraintreport-result-table-header-status": "Header of the column that tells whether the check found a violation or something else.\n{{Identical|Status}}",
	"wbqc-constraintreport-result-table-header-claim": "Header of the column that displays a link to the claim, the used property and its value.\n{{Identical|Claim}}",
	"wbqc-constraintreport-result-table-header-constraint": "Header of the column that gives information about which constraint was checked.\n{{Identical|Constraint}}",
	"wbqc-constraintreport-result-link-to-claim": "Text for the link to a claim group on the entity page.",
	"wbqc-constraintreport-result-link-to-constraint": "Text for the link to a constraint on the property page.",
	"wbqc-constraintreport-no-parameter": "Text that is displayed when there was no value for a parameter given.\n{{Identical|None}}",
	"wbqc-potentialissues-short": "Headline of the constraint report popup section for violations of non-mandatory constraints. Should be easy to understand for users, and convey that the reported violations are not always errors, but should be thought of as hints to the user that something might be wrong.\n{{Related|wbqc-constraintreport}}",
	"wbqc-potentialissues-long": "Title for the icon shown on statements with non-mandatory constraint violations, usually displayed by the browser when the user hovers over the icon with the mouse cursor.\n{{Related|wbqc-potentialissues-short}}",
	"wbqc-badparameters-short": "Headline of the constraint parameter report popup shown on constraint statements with invalid constraint parameters.",
	"wbqc-badparameters-long": "Title for the icon shown on constraint statements with invalid constraint parameters, usually displayed by the browser when the user hovers over the icon with the mouse cursor.\n{{Related|wbqc-badparameters-short}}",
	"wbqc-parameterissues-short": "Headline of the section of the constraint parameter report popup that contains problems about the constraint parameters. The section is collapsed by default, since these problems are harder to understand and fix than normal constraint violations. The headline should convey that normal users are not expected to deal with these problems.\n\nThese problems are also displayed on property pages in a separate popup: see {{msg-mw|wbqc-badparameters-short}} / {{msg-mw|wbqc-badparameters-long}}.",
	"wbqc-parameterissues-long": "Longer explanation of the section of the constraint parameter report popup that contains problems about the constraint parameters.\n{{Related|wbqc-parameterissues-short}}",
	"wbqc-problems-short": "Headline of the constraint report popup section for violations of mandatory constraints.{{Related|wbqc-potentialissues-short}}",
	"wbqc-problems-long": "Title for the icon shown on statements with mandatory constraint violations, usually displayed by the browser when the user hovers over the icon with the mouse cursor.\n{{Related|wbqc-problems-short}}\n{{Related|wbqc-potentialissues-long}}",
	"wbqc-constrainttypehelp-long": "Title for the help icon shown next to the constraint type in a constraint violation report. Clicking the icon leads to a help page on Wikidata about the constraint type.",
	"apihelp-wbcheckconstraints-description": "{{doc-apihelp-description|wbcheckconstraints}}",
	"apihelp-wbcheckconstraints-summary": "{{doc-apihelp-summary|wbcheckconstraints}}",
	"apihelp-wbcheckconstraints-param-id": "{{doc-apihelp-param|wbcheckconstraints|id}}",
	"apihelp-wbcheckconstraints-param-claimid": "{{doc-apihelp-param|wbcheckconstraints|claimid}}",
	"apihelp-wbcheckconstraints-param-constraintid": "{{doc-apihelp-param|wbcheckconstraints|constraintid}}",
	"apihelp-wbcheckconstraintparameters-summary": "{{doc-apihelp-summary|wbcheckconstraintparameters}}",
	"apihelp-wbcheckconstraintparameters-extended-description": "{{doc-apihelp-extended-description|wbcheckconstraintparameters}}",
	"apihelp-wbcheckconstraintparameters-param-propertyid": "{{doc-apihelp-param|wbcheckconstraintparameters|propertyid}}",
	"apihelp-wbcheckconstraintparameters-param-constraintid": "{{doc-apihelp-param|wbcheckconstraintparameters|constraintid}}",
	"apihelp-wbcheckconstraints-example-1": "{{doc-apihelp-example|wbcheckconstraints}}",
	"apihelp-wbcheckconstraints-example-2": "{{doc-apihelp-example|wbcheckconstraints}}",
	"apihelp-wbcheckconstraints-example-3": "{{doc-apihelp-example|wbcheckconstraints}}",
	"apihelp-wbcheckconstraintparameters-example-propertyid-1": "{{doc-apihelp-example|wbcheckconstraintparameters}}",
	"apihelp-wbcheckconstraintparameters-example-constraintid-2": "{{doc-apihelp-example|wbcheckconstraintparameters}}",
	"wbq-subextension-name-wbqc": "Name of this subextension. Is shown in special page that lists all the violations.\n{{Identical|Constraint}}",
	"wbqc-violation-header-parameters": "Header for section in violations special page that displays the parameters of the constraint.\n{{Identical|Parameter}}",
	"wbqc-violations-group": "Type of violations this extension finds.\n{{Identical|Constraint}}",
	"wbqc-violation-message": "Generic message to tell that there was a violation.",
	"wbqc-violation-message-not-yet-implemented": "Message for when a check is yet to be implemented. Not actually a violation, more of a todo.",
	"wbqc-violation-message-security-reason": "Message for when a check is not possible due to security reasons. Not actually a violation, more of a todo.",
	"wbqc-violation-message-value-needed": "Message for when a property needs a value (rather than no or some value), but hasn't.",
	"wbqc-violation-message-value-needed-of-type": "Message for when a property needs a value of a specific type (like string or wikibase-entityid), but it doesn't.",
	"wbqc-violation-message-value-needed-of-types-2": "Message for when a property needs a value of one of two specific types (like string or wikibase-entityid), but it doesn't.",
	"wbqc-violation-message-parameter-needed": "Message for when a constraint needs a specific parameter, but it's missing.",
	"wbqc-violation-message-parameters-needed-3": "Message for when a constraint needs three specific parameters, but some of them are missing.",
	"wbqc-violation-message-target-entity-must-exist": "Message for when an entity is referenced, but it doesn't exist (any more).",
	"wbqc-violation-message-value-entity-must-exist": "Message for when the property has an entity as its value, but it doesn't exist (any more).",
	"wbqc-violation-message-parameter-value": "Message for when \"no value\" or \"unknown value\" has been entered as the value of a constraint parameter that must be an actual value. $1 contains the parameter.",
	"wbqc-violation-message-parameter-value-or-novalue": "Message for when \"unknown value\" has been entered as the value of a constraint parameter that must be an actual value or \"no value\". $1 contains the parameter.\n{{Related|wbqc-violation-message-parameter-value}}",
	"wbqc-violation-message-parameter-entity": "Message for when the value of a constraint parameter must be an entity, but is some other kind of data value. $1 contains the parameter, $2 the value.",
	"wbqc-violation-message-parameter-item": "Message for when the value of a constraint parameter must be an item, but is some other kind of entity. $1 contains the parameter, $2 the value.\n{{Related|wbqc-violation-message-parameter-entity}}",
	"wbqc-violation-message-parameter-property": "Message for when the value of a constraint parameter must be a property, but is some other kind of entity. $1 contains the parameter, $2 the value.\n{{Related|wbqc-violation-message-parameter-entity}}",
	"wbqc-violation-message-parameter-string": "Message for when the value of a constraint parameter must be a string, but is some other value type. $1 contains the parameter, $2 the value.",
	"wbqc-violation-message-parameter-single": "Message for when a constraint parameter has multiple values but only supports one. $1 contains the parameter.",
	"wbqc-violation-message-parameter-oneof": "Message for when a constraint parameter must be one of several values, but is something different. $1 contains the parameter, $2 the number of allowed values (possibly 1), $3 an HTML list of all allowed values, and $4, $5 etc. are the individual allowed values.\n{{Related|wbqc-violation-message-one-of}}",
	"wbqc-violation-message-parameter-regex": "Message for when a constraint parameter must be a valid regular expression, but has an error. $1 contains the parameter value.",
	"wbqc-violation-message-sparql-error": "Message for when a constraint checker runs a SPARQL query but the SPARQL endpoint returns an error instead of query results.",
	"wbqc-violation-message-parameters-error-unknown": "Message for when the constraint parameters of a constraint could not be imported, but the reason is unknown.n",
	"wbqc-violation-message-parameters-error-toolong": "Message for when the constraint parameters of a constraint could not be imported because they were too long to be stored in the database.",
	"wbqc-violation-message-commons-link-no-existent": "Message for violation of Commons link constraint. When linked commons page does not exist.",
	"wbqc-violation-message-commons-link-not-well-formed": "Message for violation of Commons link constraint. When link contains invalid characters.",
	"wbqc-violation-message-commons-link-check-for-namespace-not-yet-implemented": "Message for when the check for the Commons link constraint has not yet been implemented for a specific namespace.",
	"wbqc-violation-message-conflicts-with-property": "Message for a violation of the “Conflicts with” constraint, when there is a statement with a conflicting property. $1 contains the property of the current statement (which has the constraint), and $2 contains the conflicting property.\n{{Related|wbqc-violation-message-conflicts-with-claim}}",
	"wbqc-violation-message-conflicts-with-claim": "Message for a violation of the “Conflicts with” constraint, when there is a conflicting statement. $1 contains the property of the current statement (which has the constriant), $2 contains the property of the conflicting statement, and $3 contains the value of the conflicting statement.\n{{Related|wbqc-violation-message-conflicts-with-property}}",
	"wbqc-violation-message-diff-within-range": "Message for a violation of the “Diff within range” constraint, when the difference between two values is smaller or larger than allowed (for a range with both limits). Parameters:\n* $1 is the first property.\n* $2 is the value of the first property.\n* $3 is the second property.\n* $4 is the value of the second property.\n* $5 is the lower bound of the range (inclusive).\n* $6 is the upper bound of the range (inclusive).\nThe “first property” is the one referenced in the constraint, and the “second property” is the one that the constraint is placed on. The difference is calculated as “second property” − “first property” ($4 − $2).",
	"wbqc-violation-message-diff-within-range-leftopen": "Message for a violation of the “Diff within range” constraint, when the difference between two values is larger than allowed (for a range with an upper but no lower limit). Parameters:\n* $1 is the first property.\n* $2 is the value of the first property.\n* $3 is the second property.\n* $4 is the value of the second property.\n* $5 is the upper bound of the range (inclusive).\nThe “first property” is the one referenced in the constraint, and the “second property” is the one that the constraint is placed on. The difference is calculated as “second property” − “first property” ($4 − $2).\n{{Related|wbqc-violation-message-diff-within-range}}",
	"wbqc-violation-message-diff-within-range-rightopen": "Message for a violation of the “Diff within range” constraint, when the difference between two values is larger than allowed (for a range with a lower but no upper limit). Parameters:\n* $1 is the first property.\n* $2 is the value of the first property.\n* $3 is the second property.\n* $4 is the value of the second property.\n* $5 is the lower bound of the range (inclusive).\nThe “first property” is the one referenced in the constraint, and the “second property” is the one that the constraint is placed on. The difference is calculated as “second property” − “first property” ($4 − $2).\n{{Related|wbqc-violation-message-diff-within-range}}",
	"wbqc-violation-message-diff-within-range-property-must-exist": "Message for violation of Diff within range constraint. When given property does not exist (any more).",
	"wbqc-violation-message-diff-within-range-property-needs value": "Message for violation of Diff within range constraint. When given property does not have a value.",
	"wbqc-violation-message-diff-within-range-must-have-equal-types": "Message for violation of Diff within range constraint. When this and the given property differ in value type.",
	"wbqc-violation-message-format": "Message for a violation of the “Format” constraint, when the value of a statement does not match a certain pattern. Parameters:\n* $1 is the property of the statement that has the constraint.\n* $2 is the text value of the statement.\n* $3 is the pattern.",
	"wbqc-violation-message-inverse": "Message for a violation of the “Inverse” constraint, when the inverse statement of a statement does not exist. $1, $2 and $3 contain the expected subject entity, property, and target entity of the missing inverse statement.",
	"wbqc-violation-message-item": "Message for a violation of the “Item” constraint, when the subject entity of a statement is missing another statement. Parameters:\n* $1 is the property of the statement that has the constraint.\n* $2 is the property of the missing statement.\n* $3 is the number of values permitted for the missing statement (or 0, in which case the constraint only specifies that there should be a statement but not the values it should have).\n* $4 is an HTML list of all values permitted for the missing statement.\n* $5, $6 etc. are the individual values permitted for the missing statement.\n{{Related|wbqc-violation-message-target-required-claim}}",
	"wbqc-violation-message-mandatory-qualifier": "Message for a violation of the “Mandatory qualifier” constraint, when a mandatory qualifier is missing on a statement. Parameters:\n* $1 is the property of the statement.\n* $2 is the missing qualifier.",
	"wbqc-violation-message-multi-value": "Message for violation of Multi value constraint. When no more than one value exists.",
	"wbqc-violation-message-one-of": "Message for a violation of the “One of” constraint, when the value is not one of the allowed values. $1 is the property, $2 the number of allowed values (note that certain constraints have only a single allowed value), $3 an HTML list of all allowed values, and $4, $5 etc. are the individual allowed values.",
	"wbqc-violation-message-qualifier": "Message for violation of Qualifier constraint. When the property is used in a claim.",
	"wbqc-violation-message-no-qualifiers": "Message for a violation of the “Qualifiers” constraint, when a statement has a qualifier but the property has no permitted qualifiers. This is a special case of {{msg-mw|wbqc-violation-message-qualifiers}}. Parameters:\n* $1 is the qualifier property that is not permitted.\n{{Related|wbqc-violation-message-qualifiers}}",
	"wbqc-violation-message-qualifiers": "Message for a violation of the “Qualifiers” constraint, when a statement has a qualifier that is not permitted. Parameters:\n* $1 is the property of the statement.\n* $2 is the qualifier property that is not permitted.\n* $3 is the number of permitted qualifiers. (This number is always greater than zero, since the special case of no permitted qualifiers is handled by the separate message {{msg-mw|wbqc-violation-message-no-qualifiers}}.)\n* $4 is an HTML list of all permitted qualifiers.\n* $5, $6 etc. are the individual permitted qualifiers.\n{{Related|wbqc-violation-message-no-qualifiers}}",
	"wbqc-violation-message-range-parameters-needed": "Message for when a constraint needs two specific parameters to form a range, but one or both of them are missing. Parameters:\n* $1 is the data type (\"quantity\" or \"time\").\n* $2 is the parameter needed for the lower boundary.\n* $3 is the parameter needed for the upper boundary.\n* $4 is the constraint type name (\"Range\" or \"Diff within range\").",
	"wbqc-violation-message-range-quantity-closed": "Message for a violation of the “Range” constraint, when the value of a statement is smaller or larger than allowed (for a quantity range with both limits). Parameters:\n* $1 is the property of the statement.\n* $2 is the value of the statement.\n* $3 is the lower bound of the range (inclusive).\n* $4 is the upper bound of the range (inclusive).",
	"wbqc-violation-message-range-quantity-leftopen": "Message for a violation of the “Range” constraint, when the value of a statement is larger than allowed (for a quantity range with an upper but no lower limit). Parameters:\n* $1 is the property of the statement.\n* $2 is the value of the statement.\n* $3 is the upper bound of the range (inclusive).\n{{Related|wbqc-violation-message-range-quantity-closed}}",
	"wbqc-violation-message-range-quantity-rightopen": "Message for a violation of the “Range” constraint, when the value of a statement is smaller than allowed (for a quantity range with a lower but no upper limit). Parameters:\n* $1 is the property of the statement.\n* $2 is the value of the statement.\n* $3 is the lower bound of the range (inclusive).\n{{Related|wbqc-violation-message-range-quantity-closed}}",
	"wbqc-violation-message-range-time-closed": "Message for a violation of the “Range” constraint, when the value of a statement is earlier or later than allowed (for a time range with both limits). Parameters:\n* $1 is the property of the statement.\n* $2 is the value of the statement.\n* $3 is the lower bound of the range (inclusive).\n* $4 is the upper bound of the range (inclusive).\n{{Related|wbqc-violation-message-range-quantity-closed}}",
	"wbqc-violation-message-range-time-leftopen": "Message for a violation of the “Range” constraint, when the value of a statement is later than allowed (for a time range with an upper but no lower limit). Parameters:\n* $1 is the property of the statement.\n* $2 is the value of the statement.\n* $3 is the upper bound of the range (inclusive).\n{{Related|wbqc-violation-message-range-time-closed}}\n{{Related|wbqc-violation-message-range-quantity-leftopen}}",
	"wbqc-violation-message-range-time-rightopen": "Message for a violation of the “Range” constraint, when the value of a statement is earlier than allowed (for a time range with a lower but no upper limit). Parameters:\n* $1 is the property of the statement.\n* $2 is the value of the statement.\n* $3 is the lower bound of the range (inclusive).\n{{Related|wbqc-violation-message-range-time-closed}}\n{{Related|wbqc-violation-message-range-quantity-rightopen}}",
	"wbqc-violation-message-single-value": "Message for violation of Single value constraint. When more than one value exists.",
	"wbqc-violation-message-symmetric": "Message for a violation of the “Symmetric” constraint, when the symmetric statement of a statement does not exist. $1, $2 and $3 contain the expected subject entity, property, and target entity of the missing symmetric statement.",
	"wbqc-violation-message-type-relation-instance-or-subclass": "Message for violation of Type/Value type constraint. When relation is neither instance nor subclass.",
	"wbqc-violation-message-type-instance": "Message for a violation of the “Type” constraint, when the subject of a statement should have be an instance of a certain type but isn't. $1 is the property of the statement, $2 is the subject of the statement, $3 is the number of classes, $4 is an HTML list of all classes, and $5, $6 etc. are the individual classes.\n{{Related|wbqc-violation-message-type-subclass}}",
	"wbqc-violation-message-type-subclass": "Message for a violation of the “Type” constraint, when the subject of a statement should have be a subclass of a certain type but isn't. $1 is the property of the statement, $2 is the subject of the statement, $3 is the number of classes, $4 is an HTML list of all classes, and $5, $6 etc. are the individual classes.\n{{Related|wbqc-violation-message-type-instance}}",
	"wbqc-violation-message-valueType-instance": "Message for a violation of the “Value type” constraint, when the value of a statement should have be an instance of a certain type but isn't. $1 is the property of the statement, $2 is the value of the statement, $3 is the number of classes, $4 is an HTML list of all classes, and $5, $6 etc. are the individual classes.\n{{Related|wbqc-violation-message-valueType-subclass}}",
	"wbqc-violation-message-valueType-subclass": "Message for a violation of the “Value type” constraint, when the value of a statement should have be a subclass of a certain type but isn't. $1 is the property of the statement, $2 is the value of the statement, $3 is the number of classes, $4 is an HTML list of all classes, and $5, $6 etc. are the individual classes.\n{{Related|wbqc-violation-message-valueType-instance}}",
	"wbqc-violation-message-target-required-claim": "Message for a violation of the “Target required claim” constraint, when the target entity of a statement is missing an expected statement. Parameters:\n* $1 is the subject entity of the missing statement, i. e. the target entity of the statement that has the constraint.\n* $2 is the property of the missing statement.\n* $3 is the number of values permitted for the missing statement (or 0, in which case the constraint only specifies that there should be a statement but not the values it should have).\n* $4 is an HTML list of all values permitted for the missing statement.\n* $5, $6 etc. are the individual values permitted for the missing statement.\n{{Related|wbqc-violation-message-item}}",
	"wbqc-violation-message-unique-value": "Message for violation of the Unique Value constraint, when other items are found. Parameters:\n* $1 is the number of other items with the same value.\n* $2 is an HTML list of all other items found with the same value.\n* $3, $4 etc. are the individual other items with the same value."
}
